{"posted_time": "2020-02-26T02:11:26.000Z", "gathered_timestamp": "2020-04-10 23:06:13.428082", "link": "https://www.youtube.com/watch?v=6EiumABeB_g", "title": "Global National: Feb. 25, 2020 | Fear growing over spread of coronavirus", "comments": [{"author": "Armenia Jones", "content": "He probably can slow it down", "score": "0", "time": "2020-03-10T21:16:01.000Z"}, {"author": "Armenia Jones", "content": "They use marijuana for everything else", "score": "0", "time": "2020-03-10T21:15:51.000Z"}, {"author": "Armenia Jones", "content": "Maybe they should use marijuana", "score": "0", "time": "2020-03-10T21:15:23.000Z"}, {"author": "Marussel Pernites", "content": "I don't believe this viruses occur naturally.  I think they're man made and are being spread to depopulate the earth.  They would increase the mortality rate of these viruses in the years to come.  The beginning of the end.", "score": "0", "time": "2020-03-03T19:50:48.000Z"}, {"author": "Whites heating & air & appliance repair", "content": "Is North Korea infected? Was this created to damage the stock market?", "score": "0", "time": "2020-03-03T06:23:19.000Z"}, {"author": "Darling Demi", "content": "I’m in Missouri I think I should be find I mean my moms a nurse so .....yeah", "score": "0", "time": "2020-02-29T16:52:33.000Z"}, {"author": "OrangeJuice Ye", "content": "If the purge happens bcd of this idk", "score": "0", "time": "2020-02-29T11:23:17.000Z"}, {"author": "Jean Sooter", "content": "It makes me sick because I'm seeing where this is going and what's going on.President Trump should shut all where borders flights everything shut them down", "score": "0", "time": "2020-02-29T04:04:45.000Z"}, {"author": "Jean Sooter", "content": "Cuz the u.s. is allowing people to come into our countryrelationship airlines everything down who cares they lose millions how many Americans have lost millions you can't even hardly live anymore cost of living", "score": "0", "time": "2020-02-29T04:03:48.000Z"}, {"author": "Jean Sooter", "content": "Oh my God they need to stop all airlines and everybody come into our country or trying to go out or whatever what's is crazy", "score": "0", "time": "2020-02-29T03:59:13.000Z"}, {"author": "Jean Sooter", "content": "No I should be able to travel abroad or coming to our country", "score": "0", "time": "2020-02-29T03:57:26.000Z"}, {"author": "Amanda Lawsonbaggs", "content": "great story", "score": "0", "time": "2020-02-29T01:26:04.000Z"}, {"author": "Se A", "content": "The Chinese eating habit must change.They must stop eating donkey, dog, sneak...........!!!! OMG!!! What kind of culture is that. They must stop eating this kind of food. Now the result is this deadly virus.", "score": "0", "time": "2020-02-29T00:55:10.000Z"}, {"author": "Tina Shay", "content": "Even if there is liver damage from Fenben, Your Liver can repair itself!", "score": "0", "time": "2020-02-28T22:42:11.000Z"}, {"author": "MaybeTheBest", "content": "I can honestly say I have never seen a fat, healthy looking person, at death's door with cancer.", "score": "0", "time": "2020-02-28T19:38:46.000Z"}, {"author": "SonicTurboTurtle", "content": "6:55 obvious deceptive editing cutting him off like that. What did he say afterwards?", "score": "0", "time": "2020-02-28T19:00:12.000Z"}, {"author": "Lisa Kaye", "content": "Is this China's warfare? I think it would be one of the things that China has created to use as part of  the country's weapons. Something must have gone wrong for them. Now what? China needs to tell the truth & figure what the hell to do now. Instead of hiding the truth of how this came about . Honesty does not kill.", "score": "0", "time": "2020-02-28T18:40:45.000Z"}, {"author": "O G", "content": "How did the virus get to Sahara tho??", "score": "0", "time": "2020-02-28T18:36:55.000Z"}, {"author": "Jay Inquisitive", "content": "Denver Airport's Murals", "score": "0", "time": "2020-02-28T17:57:43.000Z"}, {"author": "Lynda Faye", "content": "Go to Agenda Free TV-Steve READS the top news as it comes in to us, updated numbers etc. NAT news cast anchors are too busy combing their hair and fixing their makeup to INFORM US ADEQUATELY---All are at least 24 hrs., up to 2 days behind! So is the W.H.O  what ???", "score": "0", "time": "2020-02-28T17:25:12.000Z"}, {"author": "Bill Ratliff", "content": "Idiots like those Canadians still going to Italy just for a school trip will spread it..Selfish idiots..", "score": "0", "time": "2020-02-28T15:33:22.000Z"}, {"author": "Craig Luchin", "content": "If you are a Christian, then these verses are for you, \"And I heard another voice from heaven, saying, Come out of her, my people, that ye be not partakers of her sins, and that ye receive not of her plagues. For her sins have reached unto heaven, and God hath remembered her iniquities.\" If you are not, \"Therefore let all the house of Israel know assuredly, that God hath made that same Jesus, whom ye have crucified, both Lord and Christ. Now when they heard this, they were pricked in their heart, and said unto Peter and to the rest of the apostles, Men and brethren, what shall we do? 38 Then Peter said unto them, Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost. For the promise is unto you, and to your children, and to all that are afar off, even as many as the Lord our God shall call. And with many other words did he testify and exhort, saying, Save yourselves from this untoward generation. Then they that gladly received his word were baptized: and the same day there were added unto them about three thousand souls.\"", "score": "0", "time": "2020-02-28T15:13:49.000Z"}, {"author": "Dennis Hoffmann", "content": "Corona  Virus live map  @t", "score": "0", "time": "2020-02-28T10:35:04.000Z"}, {"author": "BacKYard sKy", "content": "How could he be seeating like that and then stan by podium...\nIt kind of looked staged..... pun intended", "score": "0", "time": "2020-02-28T08:03:44.000Z"}, {"author": "von Jimmy", "content": "If it hit New York City.... Its all over folks", "score": "0", "time": "2020-02-28T07:40:56.000Z"}, {"author": "TheSheeple people", "content": "STOP people TRAVELING already.", "score": "0", "time": "2020-02-28T07:15:41.000Z"}, {"author": "Misty Johnson", "content": "Ok they saying its flu like , and it last two weeks , well flu its people  in different  ways , see they not say  if gets worse at night ,cause the real flu  makes you feel bad all day  , the flu like only gets worse at night and day time you feel good .to really keep from spreading cover up when you cough , wash your hands , stay home , take sambucol black  elderberry  cold&flu relief  ,  and cough meds and lot of fluids and eat cause you have to feed it like our great mamaw say you got to feed your cold , and don't go out unless you really need to and most of all don't go to the hospital  unless your running a fewer cause hospital 's got more germs in there  from people  who really sick , some dr.'s say let run it course .", "score": "0", "time": "2020-02-28T03:56:01.000Z"}, {"author": "Brendan Koh", "content": "Anamike , Since YOU KNOW Which Table ( s ) In China Has $ , can you Please 🙏Tell Me Which One (s ) ?\nI Will Travel To China Immediately As Soon As The Covid-19 IS OVER \n😯 🤑", "score": "0", "time": "2020-02-28T03:39:37.000Z"}, {"author": "徐一凡", "content": "Please prepare a buy a lot of food", "score": "0", "time": "2020-02-28T01:57:21.000Z"}, {"author": "徐一凡", "content": "They had confirmed  a patient  in Montreal in canada ain Verdun Hospital  case .", "score": "0", "time": "2020-02-28T01:56:31.000Z"}, {"author": "acajudi100", "content": "No time to travel.", "score": "0", "time": "2020-02-28T01:36:39.000Z"}, {"author": "Mindy McIntosh", "content": "Italy should not let those students in....if we are too stupid to stop them from going!", "score": "0", "time": "2020-02-28T00:51:48.000Z"}, {"author": "Spirit CrossWind", "content": "Where the Hell is Bill Gates.", "score": "0", "time": "2020-02-27T23:55:58.000Z"}, {"author": "Sheep Tru", "content": "I looked up and saw a horse whose color was pale green. \n\nIts rider was named \n\n*Death,* and \n\nhis companion was \n\nthe *Grave.*\n\nThese *(two)* were given \n\n*AUTHORITY* \n\nOVER \n\nONE-FOURTH \n\nof the earth,\n\n● to kill \n\n*with* \n\n•the sword and \n•famine and \n•disease and \n•wild animals.\n\nRevelation 6:8", "score": "0", "time": "2020-02-27T23:07:10.000Z"}, {"author": "Sheep Tru", "content": "AIRBORN BIO WEAPON!", "score": "0", "time": "2020-02-27T23:07:00.000Z"}, {"author": "Nicholas Thien", "content": "The spreading of COVID 19 is not the virus but the stupidity of people's who still insisting to travel to high outbreak virus", "score": "0", "time": "2020-02-27T21:59:35.000Z"}, {"author": "Melinda Flores", "content": "Wash them hands with hot water an soap weaking the virus germs 👍", "score": "0", "time": "2020-02-27T21:57:07.000Z"}, {"author": "SwatsRus", "content": "The United States news blocking the comments on main news channels .. and live comments", "score": "0", "time": "2020-02-27T21:37:10.000Z"}, {"author": "Bobbie Jean", "content": "Please everybody in the USA stay in your country 🙏 thank you. This disease is no joke just seen a man laying on the sidewalk died from the outbreak real maybe this is one of the plagues of God", "score": "0", "time": "2020-02-27T21:04:10.000Z"}, {"author": "Susan Auger", "content": "They're saying a chest scan is better than the blood test", "score": "0", "time": "2020-02-27T20:26:52.000Z"}, {"author": "Jessica Hicking", "content": "This whole thing could also catapult us into a major global depression . think about all of the economic loss if this continues for any length of time!! NO COUNTRY IS READY!!", "score": "0", "time": "2020-02-27T20:11:50.000Z"}, {"author": "Jessica Hicking", "content": "There was a news broadcast that mentioned a woman in her forties who was already treated for Coronavirus got retested and is still testing positive! I wonder if this virus stays in you like other viruses do? hopefully you're still not contagious... the virus is evolving right now & mutating. There's also another case of someone that isn't tied to someone else infecting him doesn't meet the criteria! The world is not prepared for a major deadly virus!!", "score": "0", "time": "2020-02-27T20:08:18.000Z"}, {"author": "V Star", "content": "Everyone is going way overboard on this.  Check the WHO stats for 2019/20. How many people have not only been infected by influenza, but how many have died from it. Then check the stats for the Corona virus for that same period.  Influence hits us every year.  Why no panic?  More people die from the flu than this virus. People need to chill.", "score": "0", "time": "2020-02-27T20:01:36.000Z"}, {"author": "DAKAR LION", "content": "GOOD THE END IS HERE  NOW JUST WAITING ON THE RFID CHIP TO BE MADE MANDATORY THEN THE END COMES TIRED OF THIS WICKED WORLD BUT NOBODY WANTS TO BELIEVE IN THE BIBLE . HM YALL WILL BELIEVE NOW WANT YOU GOOD RIDDANCE TO AMERICA", "score": "0", "time": "2020-02-27T18:32:27.000Z"}, {"author": "Karm G", "content": "Why worry about the economic impact of taking it seriously if when it hits it does worse economic damage...", "score": "1", "time": "2020-02-27T18:17:32.000Z"}, {"author": "Shithead", "content": "Of course none of you ever stopped to think that maybe the American democrats are working with the Chinese communists to exaggerate a minor flu outbreak to cause the world stock markets to fall so they could blame Trump during an election year? Remember...this is the American democratic party. Nothing is beyond them.", "score": "0", "time": "2020-02-27T18:16:01.000Z"}, {"author": "Brendan Koh", "content": "Sure Dawn , i'm  🙏 for everyone ,\nEspecially those in Wuhan , in hospitals - patients , doctors and care givers .", "score": "0", "time": "2020-02-27T15:57:39.000Z"}, {"author": "CSXRockford", "content": "Let this be a lesson to stop depending on China for everything you depend on.  get back to making your own goods in your own country.", "score": "0", "time": "2020-02-27T14:20:33.000Z"}, {"author": "dunky dog", "content": "Look up 5g relation to corna", "score": "0", "time": "2020-02-27T14:12:58.000Z"}, {"author": "Al Ward", "content": "IS ANYONE CHECKING PEOPLE COMING OFF OF COMMERCIAL SHIPPING OR JUST TOUR SHIPS FOR THE CORONAVIRUS ?", "score": "1", "time": "2020-02-27T14:04:45.000Z"}, {"author": "The Flying Dutchman", "content": "Ahh globalism.", "score": "0", "time": "2020-02-27T13:41:43.000Z"}, {"author": "david jones", "content": "If you keep on travailing you just might get the virus! \nTHEY SURE DON'T WANT TO STOP THOSE AIR FLIGHTS! THEY MIGHT NOT GET PAID! GET REAL PEOPLE! GREED RULES THIS PLANET!!!", "score": "2", "time": "2020-02-27T13:36:40.000Z"}, {"author": "tredigi", "content": "Destroy COMMUNISM!!!", "score": "0", "time": "2020-02-27T13:25:46.000Z"}, {"author": "Saanichton Ministries", "content": "Canada is too worried about political correctness than safety.", "score": "0", "time": "2020-02-27T13:17:46.000Z"}, {"author": "Lisa-Marie Keogh", "content": "This SO CALLED VIRUS..... Where people are being detained along with Planes and Ships..... But here I am STILL GETTING MY CHINA POST FROM AMAZON AND HAVE BEEN FOR THE PAST 8 WEEKS!!!!.... 😂😂😂😂 You sheep really believe EVERYTHING THE T.V, Media, And Government tell you!! 🤪", "score": "0", "time": "2020-02-27T11:25:02.000Z"}, {"author": "Carmen Langland", "content": "The plague, people need stop do bad things, God is good he tiered the humans not listen. 🙏🙏", "score": "0", "time": "2020-02-27T11:11:51.000Z"}, {"author": "Wayne Arnold", "content": "After breaking the law they should be arrested and charged but the rcmp opp should not restrict reporting reporters must have full access", "score": "0", "time": "2020-02-27T10:51:47.000Z"}, {"author": "tony rebello", "content": "Shut all borders now", "score": "0", "time": "2020-02-27T10:01:45.000Z"}, {"author": "Tokyo Ghoul", "content": "Plague Inc.. Seems pretty Accurate lol", "score": "0", "time": "2020-02-27T07:31:37.000Z"}, {"author": "Scorpion", "content": "China, should be punished for what they did to the world.", "score": "0", "time": "2020-02-27T06:55:10.000Z"}, {"author": "Lori Anne Schmerler, PA", "content": "How foolish is NB allowing the visit to Italy", "score": "0", "time": "2020-02-27T06:40:09.000Z"}, {"author": "Rudy Gray", "content": "Another new strain of the seasonal flu virus where children and old people can die. Another day. What else is new?  Next.", "score": "0", "time": "2020-02-27T06:37:20.000Z"}, {"author": "Ali Hassen", "content": "Global news are bunch of idiots. Breaking news people Dying from Coronavirus and spreading everywhere. Breaking news we one Stanley cup cheers and drinking", "score": "0", "time": "2020-02-27T06:17:10.000Z"}, {"author": "Russell Fitzgerald", "content": "Trudeau doesn't know what to do. He is   completely inexperienced and should not be our prime minister. Get someone that will do something about it please....", "score": "0", "time": "2020-02-27T05:38:56.000Z"}, {"author": "Brad Parker", "content": "The WHO now decides its time to react two weeks ago they were sucking up to XI Jing Ping. They could have done something earlier and did nothing.", "score": "0", "time": "2020-02-27T05:35:31.000Z"}, {"author": "breckandy", "content": "Don't walk, Run!", "score": "0", "time": "2020-02-27T05:30:26.000Z"}, {"author": "nartron3000", "content": "Bill Gates is throwing a depop party 🎊", "score": "0", "time": "2020-02-27T05:08:15.000Z"}, {"author": "ART DECO", "content": "AMERICA IS PLAYING DOWN ,THEIR BIO/DEFENSE.INDUSTRY ,COULD HAVE STARTED THIS VIRUS,WUHAN IS NOT THE MAIKER OF THIS VIRUS,HOW DID IT GET THERE //QUESTIONS ??", "score": "0", "time": "2020-02-27T05:08:08.000Z"}, {"author": "Big Bertha", "content": "Patty Hajdu.....you may have the title of Health Minister, but you know absolutely nothing about this virus.  You have not familiarized yourself with international information on the virus.  \"Not many cases in Canada\".....you should change that to not many KNOWN cases.....considering it has an up to 24 days contagious incubation period.\nCanadians are a very robust people who never practice running to the doctor for the sniffles or cough, we head to the pharmacy to load up on over the counter helps.  By the time we are too sick, we will have infected many around us.  \nMost of us have been diligent to educate ourselves with information from Infectious disease doctors internationally and international news coverage on the matter.....instead of the negligent Canadian government news babble.\nBecause the news in Canada has been shrouded in negligence and non transparency in reporting, the most vulnerable among us have not been given the opportunity to adequately prepare.  \nHealthcare workers on the frontline in China with full hazmat gear have been contracting this virus and even dying.  With the lack of protective masks in Canada....what will the vulnerable public do?\nWhy must you learn from experience and not global observation?\nWell maybe class action lawsuits from the surviving families regarding the death of their vulnerable loved ones could prove to be the valuable life lesson experience you need.", "score": "0", "time": "2020-02-27T04:51:57.000Z"}, {"author": "KrisD1313", "content": "Why does the government keep paying the natives? Shouldn't they have, since the first payment, put that money towards the future?  They get NEW homes all the time, new vehicles, free University educations (that they hardly ever use), and incredible tax savings!\n\nMy family wasn't even here that long ago, and yet our taxes keep going toward paying each successive generation again, and again, and again, and again? Maybe, just maybe, we should just stop???", "score": "0", "time": "2020-02-27T04:42:46.000Z"}, {"author": "RPM", "content": "iran minister don't look to good😨😱😓", "score": "1", "time": "2020-02-27T04:23:12.000Z"}, {"author": "Vernon Bobo", "content": "This outbreak is literally the exact same plot as the movie contagion  to the T", "score": "0", "time": "2020-02-27T04:18:19.000Z"}, {"author": "Adam Williams", "content": "Off topic I know... but... the images of Venice, Italy... all were actually Milan.", "score": "0", "time": "2020-02-27T04:16:25.000Z"}, {"author": "Randy Ben", "content": "16th Native? Ur Native! Can't take the native out. You feel Native. You is. Do ur Warrior Cry. Feel the Love. The beloved truckers need jobs anyways. Be Proud. Mother Earth asks for your help.", "score": "0", "time": "2020-02-27T03:53:01.000Z"}, {"author": "Melissa Knight", "content": "First they say “don’t panic there’s nothing to worry about” and NOW that it’s down to the wire in all countries worldwide they say “oh you need to be prepared and  mind sets have to change”. SMDH all of our countries leadership are IDIOTS ! It’s all of us common citizens that work hard and pay our taxes that will suffer 🤬😡 ALL of us are cursed with idiots leading our home countries 🤬 we are being jerked around and not given the bottom line on things here in the U.S. also 🇺🇸", "score": "0", "time": "2020-02-27T03:46:05.000Z"}, {"author": "Kevin N", "content": "Be very careful when using a public restrooms, they are moist areas for the virus to thrive.", "score": "0", "time": "2020-02-27T03:18:22.000Z"}, {"author": "Kevin N", "content": "Everyone around the world should already be in 30-60 days quarantine.", "score": "0", "time": "2020-02-27T03:15:23.000Z"}, {"author": "flipgurujn", "content": "I hope Rush Limbaugh catches the coronavirus. That nut should just die already.", "score": "0", "time": "2020-02-27T03:12:23.000Z"}, {"author": "Kalashnikov613", "content": "Wait a second i must of missed something! Did i just hear that theres students going on a trip to Italy with everything happening? Mannnn!!! You either dont understand it or youre just stupid and dont care", "score": "0", "time": "2020-02-27T03:10:29.000Z"}, {"author": "Jesse Meyer", "content": "Stop letting people in. Period.", "score": "0", "time": "2020-02-27T01:59:54.000Z"}, {"author": "Alyanorno10785", "content": "With the way this virus has already influenced the economy, I’m bewildered that there hasn’t been more urgency in rectifying the current rail transportation issue that Canada is dealing with. There are over 60 tankers and freight ships lined up outside of the port of Vancouver right now because the trains aren’t running. I have noticed that certain supplies in stores are already starting to dwindle. Panic aside, this is a very troubling compounding issue.", "score": "0", "time": "2020-02-27T01:42:15.000Z"}, {"author": "Cristina Lexy Reef Tank", "content": "Borders open from 6 months ago resulting in coronavirus contaminating the 🌏whole planet?", "score": "1", "time": "2020-02-27T01:24:40.000Z"}, {"author": "starmanstriker", "content": "“Things may be escalating, were controlled”. Okay, so throwing burning tired, fire on the tracks, throwing debris on tracks, and throwing stones at trains, is not escalating things?\nGood luck with peaceful dismantling. Our police will keep it peaceful with law! No one is exempt from law!", "score": "1", "time": "2020-02-27T01:17:32.000Z"}, {"author": "sir agoy agay", "content": "If u travel ull gonna get it genius u dont even know u have it", "score": "1", "time": "2020-02-27T01:13:04.000Z"}, {"author": "Shon Moody", "content": "Hmm...how convenient that the worst and probably close to 2  worst outbreaks our are 2 greatest enemies.  Iran and China what do you think?  Inquiring mind wants to know.", "score": "1", "time": "2020-02-27T00:45:26.000Z"}, {"author": "UpsideDown World", "content": "I get it now. We're simply being prevented from travelling or escaping from the looney asylum prison, as this airborne virus has wings to fly so to chase you across the globalist-globe!\n...\"l rebuke you, \"demonic virus\" in jesus christ mighty name!", "score": "0", "time": "2020-02-27T00:20:19.000Z"}, {"author": "Walter Schwartz", "content": "Sounds like it can be come a pandemic", "score": "1", "time": "2020-02-27T00:16:46.000Z"}, {"author": "Allie Wonders", "content": "WHO week 1: \"it is just a flu\"\nWHO month 1: \"its a flu, calm down, don't stop traveling/going on with your lives\"\nWHO month 2: \"We're f*cked, we have not done enough to stop this\"\n\n.....", "score": "3", "time": "2020-02-27T00:15:27.000Z"}, {"author": "x1v160", "content": "How many Corona virus patients have you killed? How many healthy people have you killed? WHY???", "score": "0", "time": "2020-02-26T23:37:28.000Z"}, {"author": "Shaq Kobe", "content": "bat soup", "score": "0", "time": "2020-02-26T23:18:09.000Z"}, {"author": "Michelle Q Freedom", "content": "Why does this report not mention that our govs have done NOTHING and  NOT stopped flights coming here from China.  They have not done anything to prevent the spread here.  People have flown in and and gone into cities with no self \nQuarantine enforcement.  Now I hear from my Chinese friend in Vancouver that people are coming from South Korea as fast as came from China.  Our BC  gov been totally negligent and if many get sick and die they should be held responsible.   They clearly do not care about us .  Sickening. \nColloidal silver is your best bet to prevent getting sick and spray it too.  The Chinese are spraying it in hospitals.\nGet prepared to stay at home for a month or two maybe longer.  The lack of supplies in stores will be very visible soon.  \nThere could be massive economic problems over this too.", "score": "0", "time": "2020-02-26T22:36:57.000Z"}, {"author": "Cuba Bound", "content": "Guess preparing/stocking up for an earthquake has some added benefits.", "score": "0", "time": "2020-02-26T22:15:42.000Z"}, {"author": "Candystrap", "content": "What about the low income families who will have a hard time preparing with extra food? This is worrisome. I think it will hit Canada, because there doesn’t seem to be a sure way to contain this thing. I’m trying not to worry, but I watch the updates everyday, and it seems so grim.", "score": "0", "time": "2020-02-26T22:04:51.000Z"}, {"author": "Squishy Watchbee", "content": "Hello?  Cancel your trip to Italy.  Going to places that are hot beds for this virus and then bring it back to your own country, should be considered some kind of negligent homicide.  Take some responsibility for your own actions.", "score": "0", "time": "2020-02-26T21:19:05.000Z"}, {"author": "K George", "content": "IT'S NOT WASH YOUR HAND ,,,,YOU NEED TO DRY YOUR HANDS  THE VIRUS IS LESS LIKELY TO STICK TO CLEAN........DRY ...............HANDS        PLEASE PASS THIS ON", "score": "0", "time": "2020-02-26T21:12:22.000Z"}, {"author": "TheyCallMeNobody", "content": "What a change from calling us all fear mongers,bigots and conspiracy theorists.\nGuess what? We still don't trust a word that comes from these snakes in government.\nWhen they say \"don't panic,its nothing\" it means panic! When they finally get around to warning us,it's already too late. Thanks a lot Ottawa...", "score": "0", "time": "2020-02-26T20:35:08.000Z"}, {"author": "TheyCallMeNobody", "content": "What a change from calling us all fear mongers,bigots and conspiracy theorists.\nGuess what? We still don't trust a word that comes from these snakes in government.\nWhen they say \"don't panic,its nothing\" it means panic! When they finally get around to warning us,it's already too late. Thanks a lot Ottawa...", "score": "0", "time": "2020-02-26T20:34:59.000Z"}, {"author": "Monkey Kiss", "content": "They where released? Really!  They should have been executed and thrown in a fire pit.", "score": "0", "time": "2020-02-26T20:29:37.000Z"}, {"author": "Dave Heyman", "content": "Clown Show", "score": "0", "time": "2020-02-26T20:07:24.000Z"}, {"author": "jasong428", "content": "Globalism does not help anybody.", "score": "0", "time": "2020-02-26T19:34:50.000Z"}]}