{"posted_time": "2020-03-19T19:15:49.000Z", "gathered_timestamp": "2020-04-10 23:06:21.532085", "link": "https://www.youtube.com/watch?v=V9k_yezVNNY", "title": "Coronavirus around the world: March 19, 2020", "comments": [{"author": "Harry Nykorotapick", "content": "How much money will the PRICK that invented this VIRUS make when the Pandemic clears up and the stock markets go wild??", "score": "0", "time": "2020-03-29T21:31:34.000Z"}, {"author": "Harry Nykorotapick", "content": "Why does the ROYAL BANK OF CANADA  have ZERO hand sanitizer next to their ATM machines in most Branches? One of the richest companies in Canada and these PRICKS dont even supply basic cleanliness aids??", "score": "0", "time": "2020-03-29T21:28:06.000Z"}, {"author": "daddadification", "content": "coronavirus is fake they changed from coron to coron_virus or anti-body_virus\n\nit a way for people to start buying more from shops to make people\n\nNext tax for house goes up because people think its a virus\n\nnot a virus or it would have got us all because people was outside\n\ngetting the anti-body_virus without knowing it\n\nHow i be safe \nLocked myself in my room and wait for it to hurt everyone who wants it\n\ngetting the anti-body_virus  70% \n\nDoctor working on a cure 0% i know yet\n\nCure Found but i only know it \n\nits stopin you anti-body from working right \n\nMaking the ant-body slower = more infected before they try to cure it", "score": "0", "time": "2020-03-26T16:52:06.000Z"}, {"author": "Nakasusulasok na po", "content": "\"No new cases in China\"\n It's like they are lying, or this is a weapon and they already have the vaccine for it.\n I just hope it's the 1st one. 😔", "score": "1", "time": "2020-03-24T19:06:12.000Z"}, {"author": "Franklin Clinton", "content": "China just stopped reporting the new cases lol", "score": "0", "time": "2020-03-24T11:20:11.000Z"}, {"author": "KhAoz", "content": "Not to take away from the seriousness of this issue but I thought they were gonna play 'Call Me, Maybe' at the start of the video.", "score": "0", "time": "2020-03-24T08:33:54.000Z"}, {"author": "Berleezy’s booty Cheeks", "content": "Be safe", "score": "0", "time": "2020-03-24T04:22:47.000Z"}, {"author": "James Clark", "content": "I don't believe China fix their problem it's still in the air around the whole world so now they're still dying over there just like in the USA", "score": "0", "time": "2020-03-24T00:35:54.000Z"}, {"author": "IntoThe Void", "content": "Stereotype just like virus, but it damage people’s brain.", "score": "0", "time": "2020-03-23T23:37:56.000Z"}, {"author": "Freedom", "content": "Hold China accountable for hiding the information for 2 months, and allow it spreading to all over the world.", "score": "0", "time": "2020-03-23T21:33:56.000Z"}, {"author": "jaime gallardo", "content": "Lets except it, were gonna lose our planet, it doesn't matter what \"scientists\" and 'doctors\" say, unless we end the people with the viruses to prevent it to increase and kill more, then if this is the time for Earth to end, then so be it. A new life can be reborn.", "score": "0", "time": "2020-03-23T19:57:50.000Z"}, {"author": "Adan Ali", "content": "this shows even with the latest technology and medical knowledge soaring, we are weak. only the true God can help us now...not technology, not knowledge not anything...only the true God", "score": "0", "time": "2020-03-23T19:21:55.000Z"}, {"author": "Smiley Chris", "content": "Governments are shutting down jobs all over the world but they all still get paid, all government should go Payless till this is over, 99% of then has tons of money, big house but everyone else should starve!!! Spread this message!!!", "score": "0", "time": "2020-03-23T17:46:55.000Z"}, {"author": "Trevor Philips", "content": "too little too late \n\nwhen Beijing and Shanghai are fine but Western cities are not, that means government really dropped the ball", "score": "2", "time": "2020-03-23T17:16:21.000Z"}, {"author": "regular donkey", "content": "The event is unfolding as planned.\nNote the family names you won't see effected by this", "score": "2", "time": "2020-03-23T13:13:24.000Z"}, {"author": "Jimbo Bob", "content": "Australia should have closed its borders to foreigners 25 years ago don’t need them don’t want them", "score": "0", "time": "2020-03-23T12:15:32.000Z"}, {"author": "odeus predrinn", "content": "it seems that the french (professor Raoul) have found a very effective drug against covid 19, it is a treatment based on hydroxychloroquine at 600 mlg / day since 10 days ..... the action of the drug is very strong, ...;so well done and thx to the french for this discovery ! thx to telling this to the world !", "score": "0", "time": "2020-03-23T04:27:43.000Z"}, {"author": "Emma Hutton", "content": "NZ will be going into level 4 alert in 48 hours", "score": "0", "time": "2020-03-23T01:02:13.000Z"}, {"author": "Nail Polish", "content": "God is in control! Keep the FAITH❤️", "score": "0", "time": "2020-03-23T00:29:38.000Z"}, {"author": "Eliana Sul", "content": "Ainda tem essa quantidade de gente juntas", "score": "0", "time": "2020-03-22T16:37:21.000Z"}, {"author": "Xilong Zhou", "content": "Please believe China,learn from China", "score": "0", "time": "2020-03-22T12:40:34.000Z"}, {"author": "マックス", "content": "Global News clearly doesn't fact check their sources first. They'll believe anything that come out of the Chinese Communist Parties mouth. You really believe the CCP will tell the truth? They started all of this by trying to cover it up, silencing Dr. Li Wenliang one of the first whistleblowers. He died because of the CCP's negligence and the WHO Tedros Adhanom trying to down play this virus. Shame on you for spreading the CCP's propaganda.", "score": "1", "time": "2020-03-22T11:02:11.000Z"}, {"author": "I AM", "content": "The UK has socialized medicine and the system is so inefficient I fear that they will suffer greatly.", "score": "0", "time": "2020-03-22T10:54:34.000Z"}, {"author": "Universal World", "content": "Hello", "score": "0", "time": "2020-03-22T10:46:18.000Z"}, {"author": "UNITED NATIONS", "content": "News from around the world reported that the Sapporo Snow Festival spread coronavirus and many visitors around the world are died from virus.\nIf the Japanese government made human life the top priority, Japan would have stopped international events.\nBut Japan held the Tokyo marathon in early March.\nSo Virus infections are increasing in Japan and abroad now.\nWill Tokyo Olympics be held sacrificing human life?\nIOC and the Japanese government should make human life the top priority.\nI think the Tokyo Olympics should be canceled.", "score": "2", "time": "2020-03-22T02:08:53.000Z"}, {"author": "Josue Salazar", "content": "Soy el creador es es la cura", "score": "1", "time": "2020-03-21T22:43:08.000Z"}, {"author": "Charles W R", "content": "Shinzo Abe is doing this to Japan.  Japan will be Italy very soon.\n\"In the critical early days of the outbreak, Prime Minister Giuseppe Conte and other top officials sought to down play the threat, creating confusion and a false sense of security that allowed the virus to spread.\nThey blamed Italy’s high number of infections on aggressive testing of people without symptoms in the north, which they argued only created hysteria and tarnished the country’s image abroad.\"", "score": "4", "time": "2020-03-21T22:14:56.000Z"}, {"author": "Red Alert", "content": "Italy's death toll is not the highest as of now. Lie-na and the CCP have been hiding numbers for weeks now with cases being stagnant as of now. There's no way Lie-na and most of the 3rd world countries can have ridiculously low figures while European figures explode overnight.\n\n\nWake up people.", "score": "0", "time": "2020-03-21T17:22:55.000Z"}, {"author": "Astelsia", "content": "We just need to do what Hillary said.\nWe're all Stronger Together. It's time to unite against COVID-19.", "score": "0", "time": "2020-03-21T11:19:42.000Z"}, {"author": "Ap Ra", "content": "I was watching the news of one country that offered a 100% guarantee of companies whose sales fell due to the coronavirus", "score": "0", "time": "2020-03-21T04:53:40.000Z"}, {"author": "j.p grounala", "content": "Stupid worshipers", "score": "0", "time": "2020-03-21T04:07:29.000Z"}, {"author": "Ethan Kelleher", "content": "Isn’t this sad it’s devastating", "score": "2", "time": "2020-03-21T02:26:53.000Z"}, {"author": "Tania Battiau", "content": "Religion will not save you or your fellow humans ! Stop gathering to pray , you are endangering others. Selfish behaviour.", "score": "0", "time": "2020-03-21T01:45:23.000Z"}, {"author": "Rachel Melhado", "content": "Every debt incurred from corona virus. China pick up tab or world ban all products and college students from entry into rest of world and force them to shut down those god damn.  WET MARKETS", "score": "0", "time": "2020-03-20T22:21:40.000Z"}, {"author": "Jordan Rivers", "content": "You know WHO the Freak the WHO works for. WHO the world's governments work for. Governments of the False sun . The god of this world; age. The 2 Books of the Holy Bible he hates most: GENESIS: addresses his Devices. \nREVELATION: addresses his destruction. False Sun Virus: CORONAVIRUS. NO DOUBT:  satanic / manmade. \nWake Up.", "score": "0", "time": "2020-03-20T21:52:22.000Z"}, {"author": "ServantOfAllah", "content": "Ok...china we believe u...🙄🙄🙄🙄", "score": "0", "time": "2020-03-20T21:47:03.000Z"}, {"author": "Miguel Mouta Mouta", "content": "Nobody talks about Russia, Cuba, North Korea, because they have the best medical care on planet! 😀", "score": "1", "time": "2020-03-20T21:12:43.000Z"}, {"author": "Shiri Chandra", "content": "China lies and their people", "score": "0", "time": "2020-03-20T20:33:51.000Z"}, {"author": "shmunkybria", "content": "Why is it necessary to mention that Japan's tourism industry is suffering? ... its the entire world clearly", "score": "26", "time": "2020-03-20T18:31:42.000Z"}, {"author": "snowy lim", "content": "Xi jing ping brain is full of rubbish,I don't expect you have any virtue ,don't ever think you can cover when  so many people  have conclusion to what you have done or things you gonna do.", "score": "0", "time": "2020-03-20T18:02:51.000Z"}, {"author": "Makzy 2Much", "content": "Makzy2Much | EP.8 COVID-19 update life in Sydney (กินร้อน ช้อนกู ถูสบู่ อยู่ห่างกัน) 🦠🦠💉💉", "score": "0", "time": "2020-03-20T17:45:25.000Z"}, {"author": "snowy lim", "content": "Now the most terrible thing is that,he deliberately spreading this to other country,for unforgivable reason.Other words,murderer.", "score": "1", "time": "2020-03-20T17:38:47.000Z"}, {"author": "snowy lim", "content": "He represents china isn't it.Not try to blame anyone but,not even the problems he is full of lies,at the end of January,death numbers are only hundreds,only in China,suddenly at the end of February, increase to three thousand,should have close the airport when virus start spreading to other country.", "score": "0", "time": "2020-03-20T17:33:01.000Z"}, {"author": "snowy lim", "content": "Should put xi jing ping picture in here,president should responsible for the safety of their country's people.", "score": "0", "time": "2020-03-20T17:25:00.000Z"}, {"author": "stefamiec", "content": "Wearing a mask does help. People stop challenging people who are wearing mask. THEY ARE NOT SICK, IT'S FOR PREVENTION. Lesser gathering and just stay at home relax for a few weeks.", "score": "12", "time": "2020-03-20T17:22:08.000Z"}, {"author": "LISA Lapree", "content": "*****global can you ask if it's still ok for the kids to play outside while social distancing from others, will there be more online shopping being offered. Will Ontario be spraying like China on the parks ect", "score": "0", "time": "2020-03-20T17:12:15.000Z"}, {"author": "Human Being", "content": "China should be isolated from rest of the world for a year or so", "score": "1", "time": "2020-03-20T15:53:58.000Z"}, {"author": "Charles W R", "content": "Number of confirmed cases is relative to the number of tests.\nJapan's restrictive (small number of) testing is the reason for the small official count (1,639)", "score": "1", "time": "2020-03-20T15:30:56.000Z"}, {"author": "A Person", "content": "While I do agree that China is probably lying about their cases, I feel like people are just taking this opportunity to be openly racist. Don't be a dick", "score": "0", "time": "2020-03-20T12:15:04.000Z"}, {"author": "TG ETA", "content": "Even after the Coronavirus Said to be over, we still have to be careful for a few months ...", "score": "7", "time": "2020-03-20T11:46:07.000Z"}, {"author": "The Bank Beater fishing", "content": "Thanks China for this mess . Hopefully when this is over the rest of the world will boycott China.", "score": "16", "time": "2020-03-20T11:44:06.000Z"}, {"author": "Horse237", "content": "Take a zinc lozenge and chloroquine every day for 6 days and the virus disappears. That means the virus is no longer transmissible. That means the economy will turn around and we can get back to work.", "score": "0", "time": "2020-03-20T11:37:08.000Z"}, {"author": "Alan", "content": "More people living in Italy is going to die from the coronavirus soon. Rip", "score": "0", "time": "2020-03-20T11:15:19.000Z"}, {"author": "swarojit sharma", "content": "China is lying!", "score": "3", "time": "2020-03-20T08:56:39.000Z"}, {"author": "Janitra Falvierna", "content": "COVID-19: I may not the deadliest one but I can take over The World easily, So hold My Crown 👑", "score": "1", "time": "2020-03-20T06:12:32.000Z"}, {"author": "CHRISTOur ETERNALJOY", "content": "It is so sad that the world is under the control of evil one (devil)(1John5:19).and in 2Corin.4:4 the god (fake) of this world blinded the mind of unbelievers.but The TRUTH is GOD ALMIGHTY (FATHER,WORD,HOLY SPORIT) is the CREATOR of the World and All Things therein(Acts17:24).in Rev.11:15 says that all kingdoms of this world become the Kingdom of THE LORD and HIS LAMB ,and HE shall REIGN For ever and ever.There is HOPE in GOD that is Why We should do What Israelites and Jacob did to Please GOD (Gen.35:2&1Sam.7:3) to Stop that corona virus that spread the whole world.", "score": "0", "time": "2020-03-20T05:49:28.000Z"}, {"author": "Airstrykirr Labor of love", "content": "Not a COVID its a CHEMICAL AGENT", "score": "0", "time": "2020-03-20T05:40:44.000Z"}, {"author": "Al-zein Kusmantoro", "content": "New Zealand is already closing its borders to those who are not New Zealand citizens or permanent residents.", "score": "1", "time": "2020-03-20T05:40:38.000Z"}, {"author": "Adelfa Young", "content": "I don't  believe  it! This is make people  worries  for no reason. \nPleased  be nice", "score": "0", "time": "2020-03-20T04:33:27.000Z"}, {"author": "Cubamus Prime", "content": "China will pay for it's Kung Flu Virus .", "score": "0", "time": "2020-03-20T04:23:17.000Z"}, {"author": "The ultimate T-rex", "content": "I see, it close up the borders to stop the spread.", "score": "0", "time": "2020-03-20T04:13:59.000Z"}, {"author": "KK", "content": "China. Liar liar pants on fire.", "score": "1", "time": "2020-03-20T04:05:47.000Z"}, {"author": "Alicia Stephen", "content": "This is so sad!", "score": "1", "time": "2020-03-20T04:02:30.000Z"}, {"author": "Horaine Harris", "content": "May God comfort and protect us in this time of grief and sorrow. My prayer goes to the entire world:\nLord please provide an intervention for this nightmare to be over very quickly. Bless us with strength and hope to fight against and overcome this invisible enemy (coronavirus) and to provide a speedy recovery to those that are infected and who will be infected. Please strengthen our strategies to elimate the spread of the virus and to bless and protect the doctors, nurses and Healthcare workers. In Jesus Christ name I pray. Amen 🙏🏽", "score": "1", "time": "2020-03-20T03:08:28.000Z"}, {"author": "taj bd", "content": "cina can't help us", "score": "0", "time": "2020-03-20T02:38:38.000Z"}, {"author": "L", "content": "italian young ppl man.... fk... wont listen to the warning...  the average age of death due to coronavirus in Italy is 80.5 years old,  young ppl there need to be more responsible !!!", "score": "0", "time": "2020-03-20T02:28:22.000Z"}, {"author": "Dung Tran", "content": "Chinavirus D-19 has destroyed Italy completely!", "score": "9", "time": "2020-03-20T01:50:49.000Z"}, {"author": "Tryny Teichert", "content": "The media should STOP cheering for China’s LIES!!!", "score": "3", "time": "2020-03-20T01:42:41.000Z"}, {"author": "Tryny Teichert", "content": "I don’t believe anything CHINA says!!", "score": "15", "time": "2020-03-20T01:37:51.000Z"}, {"author": "Jason Jay leigh", "content": "Look people wake up ,they crashed the market before the virus got bad ,they want trump out ,crash the economy ,so china can try to take over and bring one  world goverment, russia just change laws to keep puttin 16 more years in office ,china changed and remover 5 leaders ,so he can be presadent until death, they are removing people to lower population ,redistripute wealth  our world is changed again forever as 911, turn and trust in god and your our hearts ,keep your familys safe , prepair for the worse its coming", "score": "1", "time": "2020-03-20T01:33:16.000Z"}, {"author": "TimmyLongfellow", "content": "If there are no new cases in Wuhan them I'm the tooth fairy.", "score": "1", "time": "2020-03-20T01:28:17.000Z"}, {"author": "TTW C", "content": "You dont know how tight is their isolation measures, not only in Wuhan, but across the country. No outside visitors is allowed in many districts, villages, estates, ect. Even highways have temperature check points, accross the country. If you dont know, dont talk rubbish! And 99.9% the people wear facemask when they are outside. Western govt tell people dont need to wear!  Ridiculous!", "score": "1", "time": "2020-03-20T00:54:05.000Z"}, {"author": "Jenn Clair", "content": "The background music doesn't help.", "score": "0", "time": "2020-03-20T00:49:50.000Z"}, {"author": "Cr1xus1 Gaming", "content": "Everyone please start refering to this virus as the \"Xi Jinping Virus\" this is what he should be recognized for long after he dies.", "score": "1", "time": "2020-03-20T00:47:30.000Z"}, {"author": "Janneth Chicaiza", "content": "why can't the USA close everything??...??\nwe need the streets roads... everywhere to be sanitized....This is upside down", "score": "1", "time": "2020-03-20T00:41:05.000Z"}, {"author": "Chirag Patel", "content": "*Cchhinneesee viirrus*\nStupid YT algorithm 😂", "score": "2", "time": "2020-03-20T00:13:23.000Z"}, {"author": "John Cheung", "content": "JESUS CALLS YOU ALL TO HIM 🙏 🙏🙏 🙏", "score": "2", "time": "2020-03-20T00:11:34.000Z"}, {"author": "Emilian Butoi", "content": "Jesus! Put your faith in  the Light !", "score": "10", "time": "2020-03-19T23:52:31.000Z"}, {"author": "Kenan Kilic", "content": "MY WIFE SAYS CHINA IS LYINGGGGG!!!!!", "score": "4", "time": "2020-03-19T23:37:54.000Z"}, {"author": "Claire M", "content": "lies!!!! China has new cases!!!!", "score": "3", "time": "2020-03-19T23:28:42.000Z"}, {"author": "Reza Yawari", "content": "You know who else have been recovering so well, the bats and the scorpions!!!", "score": "2", "time": "2020-03-19T23:22:41.000Z"}, {"author": "Dilys Woo", "content": "CCP Chinazi behind media will never get my support!", "score": "1", "time": "2020-03-19T22:18:22.000Z"}, {"author": "Luz Nalaza", "content": "Lies I don’t believe China anymore ..", "score": "4", "time": "2020-03-19T21:42:09.000Z"}, {"author": "Bambi Wright", "content": "The sentiment of ordinary Chinese says you can add one or 2 zeros to any numbers Chinese official outlets tell you. - Just saw some footage in Wuhan, as the CCP touting they have ZERO increase in confirmed cases, corpse movers are carrying hundreds and hundreds of bodies out of LOCKED UP buildings. Not to mention many satellite cities around Wuhan are have breakouts and released patients lapsed into dire conditions.  The CCP is an evil virus birthed by MARXISM. Communism brings out the worst in people.", "score": "3", "time": "2020-03-19T21:31:02.000Z"}, {"author": "Astro Boy", "content": "China is a Big liar! 💔😭", "score": "26", "time": "2020-03-19T21:23:39.000Z"}, {"author": "Tennis Ball", "content": "Just close everything for some time. God damn it.", "score": "5", "time": "2020-03-19T21:17:56.000Z"}, {"author": "UpsideDown World", "content": "Italy must surely have a different deadly strain of this predator engineered virus! \nBut why has Italy been hit so hard considering Rome and Vatican spared - dont get it?🤔\nMy heart goes out to Italians if this demonic activity unleashed on humanity is true - stay safe...", "score": "2", "time": "2020-03-19T21:17:26.000Z"}, {"author": "Croc Pinkest", "content": "Why can't USA start cleaning sidewalks or roads?", "score": "9", "time": "2020-03-19T21:00:12.000Z"}, {"author": "Frank Z", "content": "This is natures way. Sorry to those who cant listen", "score": "1", "time": "2020-03-19T20:58:24.000Z"}, {"author": "Dave Ryan", "content": "🇨🇳 Kung Flu 🇨🇳", "score": "9", "time": "2020-03-19T20:54:14.000Z"}, {"author": "Joe Iazzetta", "content": "To begin with, all nations debts with china should be paid in full with this pandemic china caused. And that's just for starters.", "score": "6", "time": "2020-03-19T20:33:03.000Z"}, {"author": "Randi C", "content": "Can you honestly believe that China has no new cases, just because they haven't reported it? The history of the Communist Party being honest about anything when it actually count is pretty awful. Plus they want to appear like everything is fine to both their massive population and the nations they consider to be their adversary's. The USSR did the same thing durning Chernobyl disaster in 1986. How can we be so sure about the information provide.", "score": "92", "time": "2020-03-19T20:21:40.000Z"}, {"author": "Älex ughhh", "content": "Meanwhile I’m chillin eating hot Cheetos", "score": "1", "time": "2020-03-19T20:08:54.000Z"}, {"author": "Delphi Oracle", "content": "Liar China! You thrive on deceit and lies! Ever since the World Wars you've been liars! 🖕", "score": "1", "time": "2020-03-19T20:00:01.000Z"}, {"author": "Ningombam Chanu", "content": "My advise is the people should not large gathering to fight corona", "score": "2", "time": "2020-03-19T19:59:41.000Z"}, {"author": "Scott Bowen Kelly", "content": "Let's Never Give Up Everybody The Coronavirus Will Lose We Will Take a Stand And Stop COVID-19 Until Spring And Summer Arrives", "score": "8", "time": "2020-03-19T19:59:10.000Z"}, {"author": "leroy forfun", "content": "unbelievable these measures. And everyone asks for it. Unfortunately I did it myself. I fell for it. \n\nYes we have to fight this virus of course !! . But NO !!, we shouldn't put anything down !!! \n. We must use common sense and not go along with the media hype ..!  \n\nThe elderly and care which the government is cutting back on (in almost every country) are of course the worst hit .. The elderly and care.\n\n And now you really.. really want to make me believe that these same people ....... the same governments ...   Shut down the entire economy for those people they always want and have cut back on ???\n\n  .. do you believe it yourself?\n Is there really nothing else behind this?\n \n2018-2019. Epedemic Netherlands. 165,000 infections of influenza(swineflu) and 9,500 deaths. In 14 weeks . Was there a Lock down .. NO ofcourse not  !!!\n\n\nNow it is even less worse worldwide then at the time in the Netherlands  only..   \n\nAmerica epidemic 12.500 deaths.    Where was the panic ?   A lockdown. ?\n\nNo, because  the media did not bring in some panic..\n\n \n\n we lock everyone up and still ask for more?? \n\n Why ??", "score": "0", "time": "2020-03-19T19:58:40.000Z"}, {"author": "LEGION OF SENTINELS", "content": "Get away from the cities they will become a war zone.", "score": "7", "time": "2020-03-19T19:56:12.000Z"}, {"author": "Bc R", "content": "And btw, no government in the world is able to give an exact number, but China bought time for the world, most countries cared more about money and politics than their people until now they are forced to deal with it", "score": "5", "time": "2020-03-19T19:49:54.000Z"}, {"author": "seven miller", "content": "That's because China death numbers are fibbed", "score": "2", "time": "2020-03-19T19:48:42.000Z"}]}