{"posted_time": "2020-04-11T01:31:26.000Z", "gathered_timestamp": "2020-04-10 23:06:12.381623", "link": "https://www.youtube.com/watch?v=ok5UDh8GJKs", "title": "LA Mayor Eric Garcetti Gives Coronavirus Update | NBC News", "comments": [{"author": "mike myers", "content": "ANOTHER DEMOCRAT CLOWN GFY GARCETTI 🖕🖕🖕🖕🖕🖕🖕🖕🖕", "score": "0", "time": "2020-04-11T05:56:59.000Z"}, {"author": "Anthony Ellsmore", "content": "I'm going to vomit", "score": "0", "time": "2020-04-11T05:55:43.000Z"}, {"author": "Jordan Stephen", "content": "ok", "score": "0", "time": "2020-04-11T05:50:40.000Z"}, {"author": "dougmurray42", "content": "#RepealAB5 ... End the \"non-person\" status being enforced against independent contractors by the dominent party here in California.", "score": "0", "time": "2020-04-11T05:47:42.000Z"}, {"author": "osocat", "content": "Eric you are a fuckn commie.", "score": "0", "time": "2020-04-11T05:45:14.000Z"}, {"author": "Nitra J_Live", "content": "That's my birthday date may 15th!", "score": "0", "time": "2020-04-11T05:44:21.000Z"}, {"author": "greg smoluch", "content": "Next time will be 6 more months of quarantine,  not big deal", "score": "0", "time": "2020-04-11T05:40:34.000Z"}, {"author": "Natalie", "content": "Some of these comments make me think that we deserve this.", "score": "0", "time": "2020-04-11T05:30:12.000Z"}, {"author": "rallisoify", "content": "Anyone tell this guy there is no issue? Nah. He wants control. Funk this guy.", "score": "0", "time": "2020-04-11T05:22:39.000Z"}, {"author": "Jah Senor", "content": "Trying his best to get money to illegal aliens. NOT MY TAX MONEY.", "score": "0", "time": "2020-04-11T05:18:00.000Z"}, {"author": "Jah Senor", "content": "No federal money to SANCTUARY STATES.", "score": "0", "time": "2020-04-11T05:17:13.000Z"}, {"author": "Abdulrahman X", "content": "Common sense. When someone is sick. Flu, Cold, fever, etc... Stay home, rest and get better.\n\nWhy is the Co - Virus so different? \n\nPeople are being ignorant. \nIf someone is sick. Stay home or go to doctor. \n\nThe Co - Virus = a battle of cleanliness VS. uncleanliness.\n\nShouldn't we always maintain cleanliness and good hygiene? Regardless of Co - Virus.", "score": "0", "time": "2020-04-11T05:10:59.000Z"}, {"author": "Marco Evans", "content": "Does any of these COVIC-19 deaths significantly affect (raise) the average mortality rates?", "score": "0", "time": "2020-04-11T05:09:48.000Z"}, {"author": "Jasmine Aranda", "content": "https://cash4clickz.com/dashboard/invite.php?invite=Jasmine9616", "score": "0", "time": "2020-04-11T04:59:46.000Z"}, {"author": "GreyFire Podcast", "content": "WHERE IS HIS MASK 😷!!!!", "score": "4", "time": "2020-04-11T04:58:30.000Z"}, {"author": "Chambula Testimony Tuesday/ Praise reports", "content": "WHAT ABOUT THE HOMELESS COMMUNITIES???", "score": "1", "time": "2020-04-11T04:43:40.000Z"}, {"author": "happy water", "content": "Can the government pay for non-essential business rent ????", "score": "2", "time": "2020-04-11T04:32:37.000Z"}, {"author": "Rajesh Pandya", "content": "Even after so much knowledge of virulence power, pathogenicity, and difficulty to control disease, people do not understand seriousness , they are burying dead bodies in land and not creamting dead bodies in fire.\n\n\n\n\n\nPeople and regulatory bodies must understand control procedures, post death of patient.\n\nPuting dead bodies in earth is high risk for future, as there will be many more mutations in each body and we may have 1000's of different varieties of these virus.\n\n\n\n\n\nDo we have smart epidemiologists and virologists? to persuade government to enforce policies to dispose dead bodies of such massive attack?", "score": "0", "time": "2020-04-11T04:29:59.000Z"}, {"author": "Herb Tryon", "content": "Democrats are never held accountable", "score": "1", "time": "2020-04-11T04:29:38.000Z"}, {"author": "Herb Tryon", "content": "Have you cleaned up the streets yet.", "score": "0", "time": "2020-04-11T04:28:44.000Z"}, {"author": "WickedLady2010", "content": "I got sick for 3 weeks with chest pain. Told it was bronchitis and then was well for a week. Now I'm sick again but can't get tested. I worked in retail before the shut down and dealt with a lot of people. I feel hopeless right now 😞", "score": "0", "time": "2020-04-11T04:20:21.000Z"}, {"author": "anton z", "content": "this guy was a child actor on t.v.", "score": "2", "time": "2020-04-11T04:06:16.000Z"}, {"author": "Paul Hong", "content": "Lockdown in LA will be over on May 15?", "score": "0", "time": "2020-04-11T03:47:51.000Z"}, {"author": "mike bodine", "content": "The \"govt\" response is not a fair way to phrase that. I would fear for my life if i lived in a state where the governor invites people for drinks the night before the quarantine and congregating is somehow essential. I feel lucky to live in California and LA and receive reliable, consistent information from actual leaders that can think and read. That being said our President is the leading cause of death in America and continues to dismantle the CDC as of February, look at his budget, see for yourself. I give our Boys in Cali 5 stars and call the BBB on the Trumpocracy.", "score": "0", "time": "2020-04-11T03:36:59.000Z"}, {"author": "Essie Bryant", "content": "I just sent my comment and I didn't see it where is it?", "score": "1", "time": "2020-04-11T03:36:42.000Z"}, {"author": "Adam Butler", "content": "i WONDER HOW MANY PEOPLE WILL INADVERTENTLY DIE FROM THE ECONOMIC DESTABILIZATION?\nI WONDER HOW MANY MORE PEOPLE WOULD HAVE DIED  IF WE DID NOTHING?\nI WONDER HOW MANY  HOMELESS PEOPLE DIED BECAUSE NOBODY IS OUTSIDE TO TOSS THEM A DOLLAR?\nI WONDER HOW RATIONAL HUMANS ARE?", "score": "0", "time": "2020-04-11T03:29:19.000Z"}, {"author": "TheAnnArnold", "content": "Angelinos?", "score": "0", "time": "2020-04-11T03:21:23.000Z"}, {"author": "Juci Shockwave", "content": "I've been so locked in that I had leveled my 3 Skyrim characters to legendary about ten times in most skills, and I'm close to mastering Shang Tsung in MK11, still not as a beast as I am with Kabal, but getting close. >_< Also lost 10 pounds due to rationing food. I'm also starting to get Elviras' pale skin. Two shades away from being Mortica Addams pale. ^_^ Not all have grey clouds and black storms. Some of us have light, fluffy clouds and rainbows. I wish the best for those out there who do have grey clouds and black storms.", "score": "1", "time": "2020-04-11T03:15:15.000Z"}, {"author": "Inspiration", "content": "They should allow anyone who has asthma get tested for there own safety!!\n why isn't that being done? \nAlso...staying home is fine but doesn't fix anything we should all get tested as soon as possible!!!\nThank you", "score": "5", "time": "2020-04-11T03:12:30.000Z"}, {"author": "Mike Young", "content": "Didn’t this guy die in heros?", "score": "0", "time": "2020-04-11T03:07:48.000Z"}, {"author": "Patricia", "content": "Stop the ruining of the economy. There is a cure and that safer at home is as way to terrorize people.", "score": "1", "time": "2020-04-11T03:03:54.000Z"}, {"author": "whenindangerwhenindoubtrunincirclesscreamandshout", "content": "im deaf but dont know sign can u please also do subtitles for 100% ada compliance,thnks\n..i like staying at home,lets do this forever", "score": "1", "time": "2020-04-11T03:03:21.000Z"}, {"author": "Polash Ahmad", "content": "#Stay at Home, Please..  Take care YOUR self... Please subscribe", "score": "0", "time": "2020-04-11T02:58:20.000Z"}, {"author": "indodesi", "content": "why is that lady in the back making weird faces?", "score": "0", "time": "2020-04-11T02:46:03.000Z"}, {"author": "Richard L", "content": "Easy for him to said when he get paid in stay home order while millions not so lucky plus ten of thousand of business likely go out of business.", "score": "10", "time": "2020-04-11T02:38:45.000Z"}, {"author": "Richard L", "content": "Data do show that LA had 50 times less case and death than NYC yet they imposed sticker rule (The first city in the U.S, required facemask or won't get service) Thousand of businesses and millions of workers are out of a job thanks to politicians.", "score": "1", "time": "2020-04-11T02:37:50.000Z"}, {"author": "Big Paulie", "content": "Stay safe and warm out there West coast ❤️☺️", "score": "3", "time": "2020-04-11T02:32:50.000Z"}, {"author": "T Mac", "content": "Why are you not reporting the amount of survivors there's been?", "score": "3", "time": "2020-04-11T02:29:42.000Z"}, {"author": "Akez", "content": "She is hot as chili 🔥 \nHope we would found a vaccin", "score": "2", "time": "2020-04-11T02:16:03.000Z"}, {"author": "G Clary", "content": "Can somebody invent a button to hide the signer? I cant pay attention with all the bs", "score": "4", "time": "2020-04-11T01:57:26.000Z"}, {"author": "Samuel Ortega", "content": "Hypocrisy!!!!! Vaccinations = $$$$$$$$\n125,000 deaths (abortions) per day worldwide!!  Grieving?!", "score": "1", "time": "2020-04-11T01:57:02.000Z"}, {"author": "Ron Heffron", "content": "What about temperature before going to work each day?", "score": "1", "time": "2020-04-11T01:52:31.000Z"}, {"author": "traci kreutzer", "content": "WOW great content? what a bunch of gulliable  sheep.  This content is B.S and its totally ridicoulous.  WAKE UP AMERICA", "score": "0", "time": "2020-04-11T01:44:14.000Z"}, {"author": "Expose FakeNews", "content": "This guy is definitely going to jail", "score": "7", "time": "2020-04-11T01:43:38.000Z"}, {"author": "Koski Co", "content": "Don't trust any US big Pharma to come up with a cure..\nThey just want to delay any cure and make more money.. Prove me wrong.", "score": "3", "time": "2020-04-11T01:42:25.000Z"}, {"author": "Jefe Justicia", "content": "Update: Tanks have been placed into position, quarantines are in full affect, laws have been passed to punish dissidents, 5G towers have been deployed, and the live exercise has been completely embraced by the fodder.", "score": "2", "time": "2020-04-11T01:41:58.000Z"}, {"author": "BlackEntrepreneur24", "content": "Corona was created in a lab for population control. Agenda 2030 is on its way; get prepared.", "score": "8", "time": "2020-04-11T01:40:08.000Z"}, {"author": "AMP Life", "content": "I don’t consent to any of this.!", "score": "7", "time": "2020-04-11T01:40:01.000Z"}, {"author": "Tom", "content": "great video keep up the good content", "score": "0", "time": "2020-04-11T01:37:46.000Z"}, {"author": "Tom", "content": "awesome content I loved it", "score": "0", "time": "2020-04-11T01:37:44.000Z"}, {"author": "Steve Hewkin", "content": "Isn't this is one of the \"Jerk Offs\" that hates Trump and his supporters hoping they all get sick and die?", "score": "0", "time": "2020-04-11T01:34:56.000Z"}, {"author": "Ivan Lozada", "content": "I hear trou fb msn that usa its gonna send a gray clowd of radiethion to mexico tommorow becuse mexico dont sing for the new global order. And thats the way they gonna act ....now this lady ho say so i dont know frome were she is and how did she say so for but she also warning to do not come out of home. For like 2 to a week. In home. And stay there and secure no outside air come true doors and  windows ..i mean this sound real bad .  testifying my Person and for real if its something going on like i hear in radio  that people like my color get more infected that uts racis we are make up by the same proyect of Gods proyect not even science know its proyect but annyways .we need to know something", "score": "0", "time": "2020-04-11T01:33:56.000Z"}, {"author": "The Aussie", "content": "A", "score": "0", "time": "2020-04-11T01:33:42.000Z"}, {"author": "Amy", "content": "All Buddhas bless America to Stop the spread and conquer the covid-19 quickly! Drastically reduce the number of cases and death cases! Best wishes for American people🌈🇺🇸🌞", "score": "12", "time": "2020-04-11T01:32:57.000Z"}, {"author": "anandguruji83", "content": "UNTIL MAY 15TH", "score": "1", "time": "2020-04-11T01:31:59.000Z"}, {"author": "Anthony Galatolo", "content": "When will the maryland stay at home ban lifted", "score": "0", "time": "2020-04-11T01:28:10.000Z"}, {"author": "Lynda Faye", "content": "where is this DATA ?  How many people died of the FLU OR PNEUMONIA during the same months last year, and COMPARE IT TO THIS YEAR ? And those who MUST go to work-Why don't you tell them to stop washing their hands and BUY GLOVES ? This is more redundant rhetoric.", "score": "7", "time": "2020-04-11T01:27:57.000Z"}, {"author": "tom hennessy", "content": "Contrary evidence by Artificial Intelligence (AI) software has found, increased red blood cells, hemoglobin, flags those who tend to do badly.\r\n\r\n\"Surprisingly, the study found that characteristics of COVID-19, including fever, certain features in radiographic lung images, and strong immune responses, weren’t useful\" \" Instead, the results indicated that a combination of small changes in levels of the liver enzyme alanine aminotransferase (ALT), patient-reported myalgia (aching muscles), and raised hemoglobin levels, most accurately predicted the development severe disease. Together with other factors, the team reported being able to predict risk of acute respiratory distress syndrome (ARDS) with up to 80% accuracy.\"\r\n\r\nhttps://www.genengnews.com/news/prototype-ai-tool-predicts-which-coronavirus-patients-are-most-likely-to-develop-severe-disease/\r\n\r\nSo, they wind up with ARDS and ARDS is treated with phlebotomy.\r\n\r\n“Phlebotomy was done to remove 10% of total blood volume. Symptomatic improvement was dramatic.”\r\n\r\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2878708/", "score": "0", "time": "2020-04-11T01:26:57.000Z"}]}