{"posted_time": "2020-02-28T02:26:28.000Z", "gathered_timestamp": "2020-04-10 23:06:14.203136", "link": "https://www.youtube.com/watch?v=3uEKx4uPwVg", "title": "Global National: Feb. 27, 2020 | Coronavirus has \"pandemic potential\" as cases rise globally", "comments": [{"author": "Celeste Engel", "content": "if you were planing to go to italy your plans are ruand", "score": "0", "time": "2020-03-29T20:25:48.000Z"}, {"author": "Johnson Mediva", "content": "Let's look unto God", "score": "0", "time": "2020-03-14T15:19:21.000Z"}, {"author": "Russian_Spy", "content": "This was obviously a disease made for population control by China but got out of hand cause of the lunar new year this is just my suspicion of course but I can’t help but think the corona is a biological virus don’t you guys get it the government does not care about us only our money and votes (if your living in a democratic country)", "score": "1", "time": "2020-03-14T06:58:40.000Z"}, {"author": "hydrolito", "content": "Pope seemed to have something when he was with people. He should have stayed home instead of infecting people. If you got virus be in cold, flu, corona, or anything else avoid giving it to others.", "score": "0", "time": "2020-03-13T21:04:35.000Z"}, {"author": "Ami Riegel", "content": "This is ALL A LIE PEOPLE. PRAY AND ASK GOD TO SHOW YOU THE TRUTH. WE'RE BEING PLAYED AND WE FELL FOR IT.  Re doing of the economy it will be wonderful.  SHE GOT IT FROM THE MAIL MAN.", "score": "0", "time": "2020-03-10T00:24:11.000Z"}, {"author": "Sean Black", "content": "Bunch of people freaking out for nothing.The flu is worse than the corona virus for most people.", "score": "0", "time": "2020-03-09T04:29:06.000Z"}, {"author": "XxAlex Plays RobloxX Ally", "content": "Really Wuhan city u have to eat bats and snakes oh my god", "score": "0", "time": "2020-03-06T01:50:39.000Z"}, {"author": "hairol nizam", "content": "Sorry Dr. Tedros,  correction..Iran is not a muslim country...they'r note", "score": "0", "time": "2020-03-05T18:40:50.000Z"}, {"author": "Akn videos", "content": "China says, who eat cow meet then attack by Coronavirus", "score": "0", "time": "2020-03-04T03:05:35.000Z"}, {"author": "Akn videos", "content": "Now global population control by Coronavirus.", "score": "0", "time": "2020-03-04T03:05:08.000Z"}, {"author": "Hafsa Adeel", "content": "I am scared", "score": "0", "time": "2020-03-03T13:20:27.000Z"}, {"author": "Kenny Angelo", "content": "but still I can't be more blessed that this will wipe out a lot of terrorists ...THANK YOU CHINA", "score": "0", "time": "2020-03-02T21:35:47.000Z"}, {"author": "o", "content": "Please, not another Waco massacre (where 76 adults and children were murdered). Stop demonizing the natives.", "score": "0", "time": "2020-03-02T05:04:15.000Z"}, {"author": "Elmer Tandang", "content": "Mayayaman bansa naapektohan nyan Nvov19", "score": "0", "time": "2020-03-02T04:25:42.000Z"}, {"author": "Lindy Kaz", "content": "Why are the workers in the factory touching the mask with their hands. They should have gloves on. Their wearing a mask but no gloves,WTH! No News can get anything straight with what is happening. Their information is all over the place. Bunch of tard-o's", "score": "0", "time": "2020-03-02T04:15:23.000Z"}, {"author": "Rick Pederson", "content": "Natives you lost the war !!!!!!!!!!!!!!!!!! You do not care about Canada", "score": "0", "time": "2020-03-02T03:48:35.000Z"}, {"author": "Henry Hernandez", "content": "If they close international planes the airlines could colapse", "score": "0", "time": "2020-03-02T02:01:13.000Z"}, {"author": "Northern HillBilly", "content": "lying media as usual", "score": "0", "time": "2020-03-02T00:20:41.000Z"}, {"author": "Costin Rusu", "content": "This scientist played with  God if u remember C.E.R.N the big underground machine in Switzerland ....that machine broken down 3 times and they cancelled everything.Don't play games with GOD ....GOD created this Earth not us", "score": "0", "time": "2020-03-01T23:37:56.000Z"}, {"author": "Silver Sister", "content": "President Trump was so smart to stop the flights from China before any other world leader!!!", "score": "0", "time": "2020-03-01T23:35:35.000Z"}, {"author": "Costin Rusu", "content": "What if this Covid19 have another symptoms and they are telling us lies??do you thinking about this???", "score": "0", "time": "2020-03-01T23:22:12.000Z"}, {"author": "Frank Woodward", "content": "Corona virus is in Canada but they will not test that way the government can go on saying no virus here keep working and paying your taxes so we your over lords keep getting paid and they say we will only test you if you have been in a infected area in china or have been in contact with some one with a confirmed case of the corona virus . How are we to know if we have been a round some one with the virus if there is no testing.", "score": "0", "time": "2020-03-01T23:11:59.000Z"}, {"author": "Beatle Toons", "content": "PEOPLE BETTER WAKE UP AND DO NOT GET VACCINATED AND UNDERSTAND THIS IS ALL LIES AND THEY ARE PLANNING TO KILL YOU , DONT GO ANYWHERE WITH MILITARY OR POLICE THE ONLY THREAT IS IN THE VACCINE , IF YOU GET IT YOU WILL DIE", "score": "0", "time": "2020-03-01T23:06:13.000Z"}, {"author": "jisoo2009", "content": "They are only testing voluntarily reporting, symptomatic patients in the US.  Meanwhile, Korea is testing people around every corner of the city. Wonder what the real time number is if more people are tested in the US, while people travel in and out of the country without any restrction..", "score": "1", "time": "2020-03-01T22:09:00.000Z"}, {"author": "Senaida Poulsen", "content": "It is a biological warfare\nKilling humans.\nDo not take their vaccines.", "score": "0", "time": "2020-03-01T22:06:39.000Z"}, {"author": "Susan Ponti", "content": "Other countries are canceling large gatherings, and Trump's still having rallies. Pence wiped is nose before shaking hands with one of the doctors. When is this freak Show going to come to an end? Can we please get some experience in our government.✌💙🇺🇸", "score": "0", "time": "2020-03-01T18:50:14.000Z"}, {"author": "Susan Ponti", "content": "He didn't even know if the victim of the virus was a man or a woman. That's what you get when you don't hire good advisers. Or have some and don't listen to them.😩😢😡✌💙", "score": "0", "time": "2020-03-01T18:47:14.000Z"}, {"author": "hydrolito", "content": "People should spend more time staying home instead of going out to where large number of people are. Less people you interact with the less chance of getting it.", "score": "0", "time": "2020-03-01T16:28:23.000Z"}, {"author": "hydrolito", "content": "Quarantine people that have it so it does not spread. Can keep more people out of country so they don't bring it in. Most cases in China so we especially have to prevent travel to and from parts of China that we already know have it.", "score": "0", "time": "2020-03-01T16:18:45.000Z"}, {"author": "Yo Man", "content": "The woman talking towards the end sounded sick", "score": "0", "time": "2020-03-01T14:33:24.000Z"}, {"author": "Vasen posket", "content": "I'm scared.....", "score": "0", "time": "2020-03-01T13:58:50.000Z"}, {"author": "vagaboN51", "content": "so i get that the administration doesn't want to start a panic, i get that. but at the risk of not disclosing the truth to the public. we can't count on anyone to tell us anything without the administrations approval. so we didn't learn anything from China?", "score": "0", "time": "2020-03-01T13:55:48.000Z"}, {"author": "Miguel Martinez", "content": "what hell there using this virus for president votes on ads lol their desperate", "score": "0", "time": "2020-03-01T11:37:24.000Z"}, {"author": "trump HELL 666", "content": "If you people think those masks can stop a virus then something is wrong with you. Those aren't bio-filters, they are just dust masks and stop some large particulate matter. A virus treats it like it's not even there.", "score": "1", "time": "2020-03-01T09:31:50.000Z"}, {"author": "Michael Hord", "content": "It's cold and flu season. People die from it. This is so over blown. It reminds me of the measles hysteria last year. Oh my god! Be scared of something all the time!", "score": "0", "time": "2020-03-01T05:22:16.000Z"}, {"author": "milton ritfeld", "content": "A SLOW DRIPPING SATANIC \" UN AGENDA 21\" REASON TO INFLUENCE.. DISTURB US ELECTION THRUOGH BACKDOOR..?", "score": "0", "time": "2020-03-01T04:55:34.000Z"}, {"author": "milton ritfeld", "content": "One thing good from the corona virus is THE POPE GOT IT .. hopefully. THAT WOULD BE A DEVINE INTERVENTION.", "score": "0", "time": "2020-03-01T04:49:03.000Z"}, {"author": "A.rashid Pardeshi", "content": "السلام علیکم۔ورحمتہ۔اللہ۔وبرکاتہ۔\nآے۔بی۔سی۔نیوس۔جزاك اللّه‎‎ خيرًا", "score": "0", "time": "2020-03-01T04:27:52.000Z"}, {"author": "greg fuzi", "content": "Not test stupid! She didn't meet the criteria. Stupid! That is bad in California one of the largest population in the United states is infected. Here it comes people. Going to take out the homeless. Most of them have underlying health problems.", "score": "0", "time": "2020-03-01T04:25:17.000Z"}, {"author": "Bit Shadow", "content": "4:42 Mother has a Mask But not the kid, very selfish.", "score": "0", "time": "2020-03-01T03:39:01.000Z"}, {"author": "lucysluckyday", "content": "I am sure I was not the only person screaming at the computer back in late January, \"Stop ALL eff'ing flights world wide!\"  Blind incompetence!!!", "score": "0", "time": "2020-03-01T02:52:20.000Z"}, {"author": "Karen Burden", "content": "I believe it’s worse than they think. I believe it may never be killed off in the body. Since people are getting re-diagnosed with it again, I believe it’s like a herpes virus, or sty virus, that it always stays with you, only going dormant. But any time the immune system is down/flinches, it flares up again. If I’m right, this is troubling. as it will also have so many chances to mutate, not good. Also, the length of time it lasts on surfaces, and the fact that people can have it without symptoms for a good while etc. hmm.. it’s so problematic on so many levels. The world will need to sacrifice their economies, accept a downturn, and declare a world travel ban. Tough times,  tough decisions,  tough measures, or alternatively accept there will be high casualties. I hope the medical world works on a cure in collaboration, not competition. Not everything can be about money.", "score": "0", "time": "2020-03-01T02:48:13.000Z"}, {"author": "Mike G", "content": "they are trying to crash the stock market, and the world will be in a Depression!!! and controlled by the 10% wealthy", "score": "1", "time": "2020-03-01T02:38:12.000Z"}, {"author": "Adam Dadds", "content": "It is already a pandemic by definition. The WHO will not say this yet as it will crash the markets.", "score": "0", "time": "2020-03-01T02:21:11.000Z"}, {"author": "Nicole Gillespie", "content": "The real question that nobody is asking is the virus came out of china and why so many 2000 deaths in one area? What is going on in China? Are the citizens of China suffering? THATS THE QUESTION that needs to be answered. And dont say the raw food.", "score": "0", "time": "2020-03-01T01:27:16.000Z"}, {"author": "Char Rossc", "content": "Those whales are dying from Fukushima!!! It has killed the ecology!! 🔥☢️🌎💔", "score": "0", "time": "2020-03-01T00:50:38.000Z"}, {"author": "freeWarrior", "content": "Global hoax! Wake up", "score": "0", "time": "2020-02-29T23:56:30.000Z"}, {"author": "Ed Oltjenbruns", "content": "Jesus crist  is coming soon", "score": "0", "time": "2020-02-29T23:03:43.000Z"}, {"author": "HA PHUONG - Nhịp sống Mỹ ở Texas", "content": "Thank you for your information about corona", "score": "0", "time": "2020-02-29T22:23:52.000Z"}, {"author": "Jasvir Singh", "content": "(2) Fresh garlic Early Morning time 2 Pice with water This organic treatment and 2 hours  not eat if you life safe man never know  try 1 week 💯 good for your body  5596126841 this my number if you have Corona 🦠 try all World safe your life and god bless", "score": "0", "time": "2020-02-29T21:56:59.000Z"}, {"author": "Jasvir Singh", "content": "(1) Try Onion fresh and with Salt and after 30 minutes drink water try early morning", "score": "0", "time": "2020-02-29T21:47:08.000Z"}, {"author": "tim Langdon", "content": "You got to do like President Trump did it... if you do it too fast you will have total chaos.. you would have martial law riots lights in the country had never seen before in his history... you do it too fast you will see the stock market down to go down to zero in a matter of seconds... if you have a travel ban too fast it will make the problem worse... because of president in warding America is about this for a long time. because what they do is they talk in code language... you got to listen and here what's to talk about... because fear and panic will make it worse", "score": "0", "time": "2020-02-29T21:43:23.000Z"}, {"author": "Q Min", "content": "At Brampton Civic hospital in Ontario, they have new screening questions patients answer on kiosks when they register. And signage posted here and there. The ER is packed to the brim, and they are always in a state of extreme gridlock. What will staff do should someone walk in with Covid19. Also, a GP office said if someone presents with cough + fever + recent travel, they tell them to go to the ER. Meanwhile, Ontario public health officials have said NOT to go to ERs unless you call ahead to let them know youre coming. Or call your local Public  Health for instruction. I see public and staff openly cough in waiting rooms, Not wearing masks that are provided to them. Is Brampton prepared?", "score": "0", "time": "2020-02-29T20:38:13.000Z"}, {"author": "Oscar", "content": "Chiefs of nothing", "score": "0", "time": "2020-02-29T20:23:47.000Z"}, {"author": "Gord Desm", "content": "One body, one mind. Love creates, hate destroys !", "score": "0", "time": "2020-02-29T18:43:14.000Z"}, {"author": "Ksee", "content": "I hate the girls voice its really anoying", "score": "0", "time": "2020-02-29T18:35:47.000Z"}, {"author": "Truth Hertz", "content": "NWO Global Hoax. Iran comes out of the closet.", "score": "0", "time": "2020-02-29T18:22:33.000Z"}, {"author": "wikct2", "content": "More and more studies and research have shown that the origin of the COVID-19 virus is not China.  It indicated the US might be the origin of the deadly virus.  The type of the virus from China is a child of one of the five different type of the COVID-19 virus detected in the US.  The COVID-19 is identified as the child of the one from the US.  Therefore, it is most likely the origin of the virus is from the US.  Now the scientists can determine the origin of the virus by looking the composition or mapping of the DNA.", "score": "1", "time": "2020-02-29T18:02:16.000Z"}, {"author": "TheDJRStyles", "content": "Wow.  Who listens to this trash fear propaganda?  Disgusting.", "score": "1", "time": "2020-02-29T17:36:41.000Z"}, {"author": "Sam Lams Top 10", "content": "It’s so hard to get any accurate information", "score": "0", "time": "2020-02-29T17:28:39.000Z"}, {"author": "Azazel Zel", "content": "Trump is only trying to stop mass panic, he's putting resources into fighting this virus, you slate him for that, then you will slate him for the economy going down, yep, let's all blame Trump for everything, it's worse than sad, it's quite pathetic. HOW ABOUT BLAMING F**KING CHINA????", "score": "0", "time": "2020-02-29T17:11:52.000Z"}, {"author": "Bryan Jackson", "content": "Nice to see a good cop for a change , doing the right thing for people and not corporations.", "score": "0", "time": "2020-02-29T17:03:53.000Z"}, {"author": "Gaël des Montagnes Noires", "content": "When a man cannot go to work(because of coronaV quarantine), said man still needs to pay the bills & buy food for his family & will sell any profits from his BTC portfolio to achieve this bare minimum. I can see a BTC @ $4200 1 month after the halving.", "score": "0", "time": "2020-02-29T16:56:37.000Z"}, {"author": "Forrest Gump", "content": "a little preview of GOD's arrival. GOD is good to good humans. To the evil GOD will give the proper answer.\nLuk 21:25  “And there will be signs in sun and moon and stars, and on the earth distress of nations in perplexity because of the roaring of the sea and the waves, \nLuk 21:26  people fainting with fear and with foreboding of what is coming on the world. For the powers of the heavens will be shaken.", "score": "0", "time": "2020-02-29T16:50:27.000Z"}, {"author": "Amanda Newcomb", "content": "I went to Kaiser Permanente just Thursday they told me\nCoronavirus  is not in Oregon  and nothing to worry about", "score": "0", "time": "2020-02-29T16:49:45.000Z"}, {"author": "silvério rebelo", "content": "scare mongering at the service of the globalist elitre - these pseudo-journalists should be ashamed", "score": "0", "time": "2020-02-29T16:38:02.000Z"}, {"author": "Kyma G", "content": "The world  governments wouldnt be infecting us like this would they??🤔🤔🤔 Hope you dont believe this just happened someone started this we got cases all over the US  now with no signs of travel..I wonder if they continue to kill us off who is gonna keep paying taxes for them to live so luxurious....", "score": "0", "time": "2020-02-29T16:33:30.000Z"}, {"author": "Sumaya Said", "content": "I’m scared", "score": "0", "time": "2020-02-29T15:57:08.000Z"}, {"author": "Debbie Comeau", "content": "STOP THE NEW WORLD ORDER FIGHT BACK FOR OUR WORLD ALL THE GOVERNMENTS IS A CULT )  5G IS LIKE MICROWAVE WITH THE RADIATION 5G BETWEEN 24 TO GIGAHERTZ  FREQUENCY . AND THEN ASSERTS THAT WITHIN THE RF RADIATION PORTION OF THE ELECTROMAGNETIC SPECTRUM THE HIGHER OF FREQUENCY THE MORE DANGEROUS IT IS TO LIVING ORGANISMS IN NATURE HEALTH RISKS OF 5G . AND THAT'S HOW THEY DID IT IN CHINA 5G IS THE MOST DEADLY THING ( FOR HUMANS QUICKEST EASIEST TO KILL PEOPLE OFF ) PEACE LOVE AND LIGHT DOLPHIN GIRL", "score": "0", "time": "2020-02-29T15:50:43.000Z"}, {"author": "Alice Rizing", "content": "Trade should hav  stopped", "score": "0", "time": "2020-02-29T15:49:38.000Z"}, {"author": "minghua wu", "content": "My dad is going to China am scared that my dad could have coronavirus! :(", "score": "0", "time": "2020-02-29T15:47:59.000Z"}, {"author": "Sam S", "content": "WHO and many countries waited too long, there are cases in each country going undiagnosed for sure.....there was a family in BC that went to school and work for over a week......if it’s so contagious others have it for sure...", "score": "0", "time": "2020-02-29T15:21:51.000Z"}, {"author": "antonella morra", "content": "Finitela do not die from coronavirus, at most it can make pre-existing diseases worse. I know that you journalists when this story ends you will be home without a job .... In Italy there is no pandemic, the real pandemic is over you are journalists, only all journalistic advertising", "score": "0", "time": "2020-02-29T15:09:16.000Z"}, {"author": "FirstName LastName", "content": "\"How she got Covid-19 is a mystery.\" AHhahahahA ooo ok, woaw. :'D", "score": "0", "time": "2020-02-29T15:01:08.000Z"}, {"author": "Wise Owels", "content": "CORONAVIRUS: Made in China 🇨🇳 \nEXPORTED GLOBALLY \nComing to a neighbourhood near you.", "score": "0", "time": "2020-02-29T14:54:57.000Z"}, {"author": "Universal Eye", "content": "Go police!", "score": "0", "time": "2020-02-29T14:45:14.000Z"}, {"author": "Universal Eye", "content": "Go mohawk!", "score": "0", "time": "2020-02-29T14:44:18.000Z"}, {"author": "Universal Eye", "content": "Water is life: winimiconi!", "score": "0", "time": "2020-02-29T14:40:57.000Z"}, {"author": "Jason Tsing", "content": "China has been scapegoated. It is very likely China is not the source of this pandemic. Many Americans died of influenza.Influenza？", "score": "0", "time": "2020-02-29T14:33:44.000Z"}, {"author": "Wade Burdick", "content": "5 G is the cause of covid 19", "score": "1", "time": "2020-02-29T14:33:15.000Z"}, {"author": "z z", "content": "Okay.  South Korea CDC found more than 2000 positive cases just in 3 days.\nDon't you think this is insane? most of new cases are from cult, but their government found them extremely fast and announced to public honestly.\nPlease tell me any one Asian country that can respond better than Korean government. (maybe they are doing best in the world)\nAre you sure other countries such as ASEAN and India, Pakistan..etc has less cases than S.Korea and Japan?\nThere are tons of Chinese tourists in Philippines, Vietnam, Thailand, Indonesia, India, Malaysia... Everywhere in the world.\n It looks so hilarious other developing countries are started to ban Koreans to enter their country.   Let's see whats gonna happen next month.", "score": "0", "time": "2020-02-29T13:44:25.000Z"}, {"author": "Kevin Blanc", "content": "Isn’t this the beginning of the Walking dead.   This virus can’t be contained. We are already passed that. Best bet is to create a Vaccine.", "score": "0", "time": "2020-02-29T13:23:30.000Z"}, {"author": "Fulca", "content": "Everyone out there be careful and wear a freaking mask! \nThis will pass as everything else !", "score": "1", "time": "2020-02-29T13:12:47.000Z"}, {"author": "T M", "content": "A patented virus that was used as a cause for the Event 201 excercise? Sounds more than fishy. Thanks Bill & Melinda Gates", "score": "0", "time": "2020-02-29T11:19:52.000Z"}, {"author": "midiland mainline 752", "content": "DID you not here the WHO it doesn't matter wha you call it a pandemic it won't help save a life", "score": "0", "time": "2020-02-29T11:01:53.000Z"}, {"author": "Dragon Explain", "content": "I wonder if the Americans don't get a SARS-CoV-2 test because of the 3500 dollar bill that comes with hmmmmm🤔", "score": "0", "time": "2020-02-29T10:55:22.000Z"}, {"author": "allan strand", "content": "Thai doctors cured 71 old with cocktail of Hiv and flue medicine last week !", "score": "0", "time": "2020-02-29T10:47:37.000Z"}, {"author": "Mehak Chaudry", "content": "That’s stupid why they letting people travelling from China to other country", "score": "0", "time": "2020-02-29T08:42:08.000Z"}, {"author": "ppurppple", "content": "well if we die  of virus we need less fish and travel so the world and whales will benefit", "score": "0", "time": "2020-02-29T08:41:46.000Z"}, {"author": "ppurppple", "content": "you cannot rely on oil it will run out sometime", "score": "0", "time": "2020-02-29T08:37:10.000Z"}, {"author": "ehem aga", "content": "they must test the whole world", "score": "1", "time": "2020-02-29T08:22:47.000Z"}, {"author": "E O", "content": "We are a month behind people,  Get real.  This has been silently been spreading in the US since December disguised as the flu.", "score": "0", "time": "2020-02-29T08:08:52.000Z"}, {"author": "周玉蔻前空軍F-16飛官", "content": "Against corona virus: Prepare your food at least for 2 weeks  and make sure wear masks if you go out in public.  Trust yourself instead of lies from government. \nWe all know hospitals have no enough manpower and equipment for the out break. \nWe on our own sadly", "score": "0", "time": "2020-02-29T07:47:03.000Z"}, {"author": "周玉蔻前空軍F-16飛官", "content": "Ppl who bashing WHO leader. You should do some research before you post your comments. Some ppl need Grow up", "score": "0", "time": "2020-02-29T07:39:47.000Z"}, {"author": "An123Observer", "content": "We have nothing to fear but fear itself... Do yourself a favor, compare worst case covid 19 against smoking, car accidents, air pollution or alcohol, not to mention heart disease or cancer. It's just a nasty flu, what scares me is that people are running around shouting the sky is falling instead of looking at facts or related issues like the danger of mass panic. People are going to look back and shake their heads at how intensely we ***** ourselves in the name of fear. 😟", "score": "0", "time": "2020-02-29T07:17:13.000Z"}, {"author": "Motivational Monday", "content": "This stuff is getting out of hand. I have yet to hear a legitimate and valid argument as to why the blockades were installed in the first place. The media seems to interview the less informed members of the group. Also,  attempting to cause a derailment of a train potentially loaded with dangerous goods while protesting to protect your land seems like a great idea....", "score": "0", "time": "2020-02-29T06:52:09.000Z"}, {"author": "Jay Picard", "content": "Check your facts, it already technically is a Pandemic under the scientific definition of a Pandemic. \nYour welcome BSc Hons", "score": "0", "time": "2020-02-29T06:50:08.000Z"}, {"author": "Imperial Dovahkiin", "content": "China's propaganda is going to kill us all.", "score": "0", "time": "2020-02-29T06:05:52.000Z"}, {"author": "Caiisha Zain", "content": "China they eat everything like snake , rat and a lot think.", "score": "0", "time": "2020-02-29T05:58:43.000Z"}, {"author": "dominic", "content": "OMG CANADA IS SO WEAKS, MEDIUM SIZE COUNTRY CAN INVADE IT. HAHAHHA PATHETIC. CANT EVEN ENFORCE ITS OWN COURT ORDERS", "score": "0", "time": "2020-02-29T05:42:31.000Z"}]}