{"posted_time": "2020-02-27T03:13:22.000Z", "gathered_timestamp": "2020-04-10 23:06:16.007327", "link": "https://www.youtube.com/watch?v=sfzEbcjE2rE", "title": "NBC Nightly News Broadcast (Full) - February 26th, 2020 | NBC Nightly News", "comments": [{"author": "Flora Havard", "content": "You are not ready for anything yet You are misleading people's and fighting Against God Almighty this the wrath of God you dealing with not man made 💯 percent. we had better pray and turn to God and ask God to forgive you for your sins.", "score": "0", "time": "2020-03-26T02:04:12.000Z"}, {"author": "robert miller", "content": "less than 0.000001% of the population is infected - so that is the threshold of a pandemic ? global pop of over 10 billion less than 100,000 infected - yep it the end of the world", "score": "0", "time": "2020-03-04T16:12:41.000Z"}, {"author": "Fliteskin Aeroscale", "content": "https://youtu.be/OM8GO7yEjfE", "score": "0", "time": "2020-03-03T00:02:34.000Z"}, {"author": "Bill Hawkins", "content": "They were eating bats.  Little furry flying Critters.  Nobody eats bats ...  We have this coming just for letting that happen.", "score": "0", "time": "2020-03-02T18:43:24.000Z"}, {"author": "Artemirr Lazaris", "content": "So the joke about coronavirus is that it's common cold, it mutates every seasonal term in a pattern. That's why it's 19cod. This fear mongering is rather funny. It allows getting the idiots that live in fear to correct their habits. Pretty sure everyone has gotten the common cold.", "score": "0", "time": "2020-03-02T17:56:54.000Z"}, {"author": "Von Allan", "content": "your being lied to!!! https://www.youtube.com/watch?v=NVzne_ZQ0Vo  @13:13!!!!", "score": "0", "time": "2020-03-02T16:25:11.000Z"}, {"author": "tiny little me", "content": "1. Global Warming/Climate    Change...🤪\n2. Trump's Impeachment Trial...🤪\n3. Coronavirus Outbreak...🤪", "score": "0", "time": "2020-03-01T17:59:30.000Z"}, {"author": "tiny little me", "content": "People should stop their flatulation in public to prevent the virus from spreading.😷", "score": "0", "time": "2020-03-01T17:35:21.000Z"}, {"author": "tiny little me", "content": "Trump's pink eyeshadow matches his pink tie. 😉", "score": "0", "time": "2020-03-01T17:26:47.000Z"}, {"author": "aomanchutube", "content": "I totally missed this. We got a beer related mass shooting and a beer related Pandemic virus. Now I'm going to be on the lookout for beer relations with other things. Like the Taliban, is that a middle East beer name? Or location of make? Maybe that's where pilsner was invented? Trump is easy, he's obviously slightly drunk all the time.", "score": "0", "time": "2020-03-01T11:52:12.000Z"}, {"author": "ThaReal Truth", "content": "You expect after generations and generation of people who probably been handling these bats that long all of a sudden they touch blood or. Urine you really think people are dumb", "score": "0", "time": "2020-02-29T18:52:30.000Z"}, {"author": "AtoZ", "content": "It took Noah 100 years to build the Ark. For 100 years he was made fun of. \"Look at Noah, he's such a conspiracy theorist. Why is he prepping when the world is doing so well right now\".\n\nThen it started to rain......\n\nLooks like us prepped were right", "score": "0", "time": "2020-02-29T18:16:07.000Z"}, {"author": "Gmmonica godsgotthis", "content": "We need to try and push the government to close the borders so that the Coronavirus will not continue to infect Americans like other countries have closed the borders to protect their people. the all this is is a money grab for the hospital's FDA and big Pharma and its corruption", "score": "0", "time": "2020-02-29T18:08:48.000Z"}, {"author": "Noel Blake", "content": "Corona virus American death 0 7/11 employees killed over night 200k", "score": "0", "time": "2020-02-29T17:22:05.000Z"}, {"author": "James Lee", "content": "The fall was an accident...there is a video of it.", "score": "0", "time": "2020-02-29T14:55:07.000Z"}, {"author": "Rob Roberts", "content": "Lies and more lies from the medical field. WTF are you doing Carnival your at fault. What company leaves a sixth floor window able to be opened?", "score": "0", "time": "2020-02-29T14:39:06.000Z"}, {"author": "Internet Marketing Maps", "content": "*_The man they fired unjustly, lost his house as a result - But that's not all he lost, he also lost his wife, his dignity and his vehicle was repossessed, so what did they expect? ...Did they really expect this man to simply roll over and die? ...Because, that's exactly what he did do, but before that, he had some unfinished business to take care of and few scores to settle, and he did that also._* 👀😩", "score": "0", "time": "2020-02-29T10:48:14.000Z"}, {"author": "Val Tito", "content": "NOgoodBullshitCenter", "score": "0", "time": "2020-02-29T08:03:35.000Z"}, {"author": "Reck Tom", "content": "Not to worry everyone Pence is on the case. He’ll get to the bottom this. \nCoronavirus😏.....you little rascal.", "score": "0", "time": "2020-02-29T05:39:12.000Z"}, {"author": "Flip Ya", "content": "Just what the heck are they spraying?.", "score": "0", "time": "2020-02-29T04:52:12.000Z"}, {"author": "S. Roy", "content": "Corona Virus = CCP strategy to be Super Power\nCCP = A World  Threat for Humanity", "score": "0", "time": "2020-02-29T04:31:35.000Z"}, {"author": "Warren G.", "content": "Man fired, because he got sick, given points , had to let him go because of bad policies. You wonder why people get angry and shoot people , who enforce such bad policies.", "score": "0", "time": "2020-02-29T03:42:34.000Z"}, {"author": "Umar Abdullah", "content": "More scared of Corona virus than guns?", "score": "0", "time": "2020-02-29T01:40:09.000Z"}, {"author": "Umar Abdullah", "content": "Gun Control anyone?", "score": "0", "time": "2020-02-29T01:39:46.000Z"}, {"author": "John Halstead", "content": "Those masks are a fake.  It can stop either you give out the virus 🦠 or taking the virus 🦠 In.  Another way to take our money.", "score": "0", "time": "2020-02-28T21:49:18.000Z"}, {"author": "SPONGE BLOB BLUETOAD", "content": "Thanks trump you are a big help to America", "score": "0", "time": "2020-02-28T21:28:18.000Z"}, {"author": "Jaeger Man", "content": "People seriously watch this government crap ? CNN, ABC, CBS, NBC, MSNBC, BBC ETC government scripted  ''news'' lies.", "score": "0", "time": "2020-02-28T21:10:54.000Z"}, {"author": "ace ventura", "content": "coronavirus is nothing new do your research  .the media is hyping this up to crash our markets. open your eyes", "score": "0", "time": "2020-02-28T20:36:45.000Z"}, {"author": "Lavern Scott", "content": "What is wrong w these old dem?☺ fighting againest each other to win just words who .said this who said this who said tha?☺😜one of them will die before the elec?☺ they should stick to each other and dont give the demon way to enter but what i dont like .joe elez bernie cursing each other i want us to win to get out the demon but i dont like the way they turning againest each other it not sopose to be that way i would they all run in peace .they are not young like when oboma?☺ take office cant they see they are going to drop dead before that day its 2 much stress? And none of them are poor so what are they fighting for money it do not worth it time is short?☺😙😛😊", "score": "0", "time": "2020-02-28T20:00:42.000Z"}, {"author": "thomas boyd", "content": "liars", "score": "0", "time": "2020-02-28T19:31:55.000Z"}, {"author": "thomas boyd", "content": "fu lester the jester", "score": "0", "time": "2020-02-28T19:31:00.000Z"}, {"author": "thomas boyd", "content": "and level 4 bio wep released escaped then blame game what a shame", "score": "0", "time": "2020-02-28T19:30:19.000Z"}, {"author": "thomas boyd", "content": "yeah and all those app permissions dummy", "score": "0", "time": "2020-02-28T19:26:50.000Z"}, {"author": "thomas boyd", "content": "Michael Jackson copycat sad", "score": "0", "time": "2020-02-28T19:23:47.000Z"}, {"author": "Ethan", "content": "Glad you didn't gut the team of 12 of the best pandemic scientists in 2017 and not replace them.  Oh wait, you did.", "score": "0", "time": "2020-02-28T19:01:02.000Z"}, {"author": "Ethan", "content": "Anybody recognize the rifle, or suppressed subgun the officer at 02:24 is waling with?  The long, slotted receiver and the AR accessories are throwing me.  Doesn't even look like an AR build, or even like an MP series.  Even a custom job should have a receiver I recognize.", "score": "0", "time": "2020-02-28T18:56:54.000Z"}, {"author": "Jesse Seymour", "content": "Most shocking thing in this is that they managed to mention trump without bashing him or making it all his fault.", "score": "0", "time": "2020-02-28T18:23:33.000Z"}, {"author": "Jesse Seymour", "content": "Noone cares what Nancy said.", "score": "0", "time": "2020-02-28T18:17:18.000Z"}, {"author": "kirk barr", "content": "trump 2020", "score": "0", "time": "2020-02-28T18:10:39.000Z"}, {"author": "kieth thornton", "content": "If they Dont make very very afraid than they cant get you take the Vaccine that they make in the out brake labs brake out labs No FEAR NO RICHEST off the Vaccination shot that will make Billions.", "score": "0", "time": "2020-02-28T17:24:42.000Z"}, {"author": "Jr C", "content": "Can you get it by scratching your butt👀🤦🏻‍♂️", "score": "0", "time": "2020-02-28T17:18:49.000Z"}, {"author": "Gary Lewis", "content": "16:00 I was at the Hong Kong air port in 2013 a small baby was crawling towards a hand railing. It was a 50ft drop to the floor below. The baby was crawing through the handrailing. Luckly the mother grabbed her baby just in time. I was a few feet behind her. \nIt was a no child proof  handrailing. Horizontal bars not vertical bars spacing should have been 4in. Horizontal bars are NO good, because children play and they use them as a ladder. The ergonomic standards may be different on ships then on land  (the national building code may not apply on ships.) This guy's lawer should investigate. An engineer told me when he saw the movie \"Titanic\" Jack at the bow was standing on one of these horizontal rugs of the handrail when he said \"Im king of the world\" my engineer friend said to me \"if i designed a handrailing like that id get fired\"", "score": "0", "time": "2020-02-28T16:50:31.000Z"}, {"author": "matt87635", "content": "Who cares about Cuba?\nAmerica fisrt.", "score": "0", "time": "2020-02-28T16:03:06.000Z"}, {"author": "Smoking Beetles", "content": "Thought they said it was a pangolin now it's back to a bat?", "score": "1", "time": "2020-02-28T15:48:45.000Z"}, {"author": "Eri L", "content": "This IRS phone scammed has been going on for years in my home town glad it's was covered that the IRS never calls", "score": "0", "time": "2020-02-28T14:23:20.000Z"}, {"author": "Joe Smith III", "content": "And yet they do so much less for the flu, which infects billions", "score": "0", "time": "2020-02-28T13:26:39.000Z"}, {"author": "Julie Johnson", "content": "Yep  if not airborne then gloves I guess", "score": "0", "time": "2020-02-28T12:33:08.000Z"}, {"author": "Ahmed Osman", "content": "Garlic oil", "score": "0", "time": "2020-02-28T07:36:28.000Z"}, {"author": "Jacquelynn", "content": "\"The virus is spreading fast.\"", "score": "0", "time": "2020-02-28T06:04:17.000Z"}, {"author": "Steven Sandefur", "content": "Hate Corona love Budweiser", "score": "0", "time": "2020-02-28T04:50:55.000Z"}, {"author": "J L", "content": "How dumb is the human race, people are still traveling all around the globe", "score": "0", "time": "2020-02-28T04:49:28.000Z"}, {"author": "Rodnell Alcika", "content": "👽👂🏿THE 4-HORSE -MENS  OF THE APOCALYPSE HERE,THE WORLD IN GOD JUDGMENTDAY👈", "score": "0", "time": "2020-02-28T04:25:34.000Z"}, {"author": "Jason H", "content": "Can I get Lime with my Corona Virus? Thank-You.", "score": "0", "time": "2020-02-28T04:24:56.000Z"}, {"author": "Shakira Bells", "content": "you dont know whos human being is infected already this virus is spreading in the globe goshhhhh", "score": "0", "time": "2020-02-28T03:47:08.000Z"}, {"author": "alohatic", "content": "Just give it sometime and it would be thrown in the mix of the fluid concoction for a regular flu injection.", "score": "0", "time": "2020-02-28T03:37:31.000Z"}, {"author": "manny_ nuff", "content": "I got a (virus) and the only prescription is more (Coronas). 🍻😂🤣", "score": "0", "time": "2020-02-28T03:16:35.000Z"}, {"author": "Greg Grisham", "content": "Gun n badge hometown traitors holding us and humanity hostage or we couldn't be stalked. I had a stalker show up after 35yrs. All committing TREASON on capital hill for decade's taking BRIBES privatizing everything including all seats of power every two and four years. All murderers and all child abductions start with being held hostage by www666ville ANTICHRIST UNHOLY ROMAN BIBLE EMPIRE government swords and shields evolutionized into guns and badges holding us and humanity hostage. We must March n revolt become secound amendment n bare arms against antichrists traitorous churchville government holding us and humanity hostage before to late", "score": "0", "time": "2020-02-28T03:09:50.000Z"}, {"author": "Steven Bryant", "content": "Why worry about viruses and wildlife when people are making money off black market or the Panama Canal trade?!", "score": "0", "time": "2020-02-28T03:04:43.000Z"}, {"author": "Chaz Tupper", "content": "90% BS...10% truth..", "score": "0", "time": "2020-02-28T03:02:40.000Z"}, {"author": "Lucky U. Tin", "content": "Bill de Blasio is anti-police.", "score": "0", "time": "2020-02-28T02:53:40.000Z"}, {"author": "Steven Bryant", "content": "Oak Creek, WI in 2012. Remembrer, it was six shot then too.", "score": "0", "time": "2020-02-28T02:53:35.000Z"}, {"author": "Gas", "content": "same as yesterday", "score": "0", "time": "2020-02-28T02:51:49.000Z"}, {"author": "Lucynda Riley", "content": "Isn't California monitoring  8400 suspected cases?", "score": "0", "time": "2020-02-28T02:47:40.000Z"}, {"author": "HUNG MIN", "content": "The Coronas are here to stay. The bats will rule the world bc they have Corona weapon. We need to learn why bats can live w Corona.", "score": "0", "time": "2020-02-28T02:47:17.000Z"}, {"author": "Vanya Davydov", "content": "The intro told me everything. Good bye.", "score": "0", "time": "2020-02-28T02:29:40.000Z"}, {"author": "ipressedabutton", "content": "14:21 harvey swine-stein", "score": "1", "time": "2020-02-28T02:25:48.000Z"}, {"author": "ipressedabutton", "content": "13:51 good for AL losing all that weight.", "score": "0", "time": "2020-02-28T02:25:00.000Z"}, {"author": "Fun Guy", "content": "We Chinese we make joke we put virus in your coke.", "score": "1", "time": "2020-02-28T02:22:52.000Z"}, {"author": "LeavingIt Blank", "content": "Captured with a butterfly net.  Now I feel better.", "score": "0", "time": "2020-02-28T02:19:50.000Z"}, {"author": "ipressedabutton", "content": "5:09 i don't want to promote conspiracy theories , but there is a lot of room here for conspiracy theories to be worked out. all that's needed are some greedy rich people that are interested in reducing the global population, last time i checked there was no shortage of those.", "score": "0", "time": "2020-02-28T02:14:55.000Z"}, {"author": "ipressedabutton", "content": "4:10 i can't trust a known and documented liar and philanderer to be in charge of protecting my life. \ni don't believe a liar and philanderer has my best interests in mind.", "score": "2", "time": "2020-02-28T02:11:00.000Z"}, {"author": "chester", "content": "9:30 They don’t „butcher“ the Bats. They throw them alive in a pot of Boiling Water or Broth like we do Lobster.", "score": "0", "time": "2020-02-28T02:10:46.000Z"}, {"author": "ipressedabutton", "content": "he was a \"fired\" employee. he got triggered..", "score": "0", "time": "2020-02-28T02:01:31.000Z"}, {"author": "Amit Lal", "content": "See that's what we need more guns if all those employees had gun maybe they would just shoot each other because they would not know who is the real killer everybody has a gun just shoot the Gun Man but everybody has a gun but just shoot the Gun Man we need more guns", "score": "0", "time": "2020-02-28T01:58:32.000Z"}, {"author": "Tiffany Parrish", "content": "Interesting how it's getting worse every month. Pretty soon we will have to purchase hazmat gear!", "score": "0", "time": "2020-02-28T01:58:26.000Z"}, {"author": "Dontyu worrie", "content": "Big pharma is like \"hmmm how can we jack up the price of cure and make billions ?\"  Topic of our next quarterly meeting...", "score": "0", "time": "2020-02-28T01:58:06.000Z"}, {"author": "Dontyu worrie", "content": "Pence looks like he has a fever...hope hes ok", "score": "1", "time": "2020-02-28T01:55:37.000Z"}, {"author": "Rodger Rothrock", "content": "It's all about money and getting as much as you can, so you have a great life, news flash people we are not here on vacation and every single person chasing money around are GOI g to realize I hope soon that  money does make things easier in life but keep in mind who gave you the ability to get it, anyways if one person gets somthing positive from this it was worth the time I took out of my life to say", "score": "0", "time": "2020-02-28T01:50:49.000Z"}, {"author": "Rodger Rothrock", "content": "I mean if I'm the only person that was selected by the most greatest, to be here you are rich from the start if your taught correctly,  but we get lied to all our life's to not talk about it, just like Christmas these kids now  have no clue,  why Xmas is even for, except a fat guy in a red suit, giving away stuff and in some way to me it's like rewarding kids for not asking or thinking why there is Xmas", "score": "0", "time": "2020-02-28T01:43:45.000Z"}, {"author": "Rodger Rothrock", "content": "I do feel sad for the victims, but it's only going to get worse, school shootings for example, no prayer no kindness, we are taught all our life's to get education and be proud of your accomplishments, from that first moment a person feels that they feel accepted and worth something but never taught who gave them the ability to acheive that", "score": "0", "time": "2020-02-28T01:36:18.000Z"}, {"author": "Nana Clark", "content": "Start more effective population control of bats by terminating a lot of them", "score": "0", "time": "2020-02-28T01:34:40.000Z"}, {"author": "Phillipe Gonzalez-Rodrigo", "content": "It came from a bat? What a joke! How many of you are believing that lie?", "score": "0", "time": "2020-02-28T01:32:03.000Z"}, {"author": "Nana Clark", "content": "I'm slightly scared", "score": "1", "time": "2020-02-28T01:29:59.000Z"}, {"author": "Rodger Rothrock", "content": "These shootings are happening because this  person was probably fired over unfair practices that big corps do to people all the time, not sure what the motive was but I'm sure I'm close because corporate greed is out of control and people do these horrible things because nobody listens to the way our hard working people  are getting screwed and it affects family then it's petsonal,  and God plays a huge part of all of it because nobody has or makes time to think about anything to help improve these situations because nobody cares, no family values at home because it take 2 people in a house hold to work to eat and live", "score": "0", "time": "2020-02-28T01:29:42.000Z"}, {"author": "Rami Lucky", "content": "We have to watch these people’s come here from his own country to come here to be safe but these people’s you will try to come around watch that", "score": "0", "time": "2020-02-28T01:29:41.000Z"}, {"author": "strawberryhaze85", "content": "this is what happened when you need a social security to buy a gun...", "score": "0", "time": "2020-02-28T01:26:45.000Z"}, {"author": "Andrew Macaulay", "content": "Its funny that yous onlyreport on disasters your bosses have done but want you to cover for them", "score": "0", "time": "2020-02-28T00:59:52.000Z"}, {"author": "Norman Spurgeon", "content": "Of course their is no mention of the type of weapon used- I'm betting it was an automatic weapon- of course the network is bowing to pressure from the NRA and probably senators, etc., to remain hush about the type of weapon used- this would instigate a normal response to try to curtail the use of these weapons, to prevent further deaths. They have no intention of doing this.", "score": "0", "time": "2020-02-28T00:48:06.000Z"}, {"author": "James Gearring", "content": "Do not let any Chinese in the USA", "score": "0", "time": "2020-02-28T00:37:42.000Z"}, {"author": "Erincait Rue", "content": "Boy trump’s a real gem he panics everybody about an invasion from South America about some barefooted people with , And now that there is a real threat The Coronavirus he doesn't sound alarms to be careful...it is not like the ful,, Be careful. Especially the elderly and sickly!", "score": "0", "time": "2020-02-28T00:37:16.000Z"}, {"author": "Bryan S", "content": "Humanity is now in a Global Pandemic. It's now on every continent on the planet except Antarctica. Time to prepare and hunker down. Go to Worldometer", "score": "0", "time": "2020-02-28T00:35:53.000Z"}, {"author": "UniteOurWorld", "content": "1200 hospital beds, ready. That will cover the Pentagon staff...", "score": "3", "time": "2020-02-28T00:33:10.000Z"}, {"author": "No Time2bperfect", "content": "Literally, every time #NBC starts the broadcast it's \"breaking news.\" Anyone ever hear of the boy who cried wolf? Someone do a compilation of the beginning of the broadcast with breaking news said to get an idea of this nonsense", "score": "6", "time": "2020-02-28T00:16:56.000Z"}, {"author": "Leo Rayes", "content": "Don't worry its not out and about it's contained if it get's omnipresent I'll let you know just keep up with the cases for now as a strategy and prep up  and secluded your self.", "score": "0", "time": "2020-02-28T00:13:15.000Z"}, {"author": "Vanessa Davis", "content": "we walk on the road with our shoes.  ppl spit on the road we walk on it.  then we go home with the shoes then we walk in the house with it.  we take off gloves with one hand and contaminate the other.  our clothes we take off when we get home and it can be contaminated.  we go out next day and wear the same shoes. this is scary.", "score": "0", "time": "2020-02-27T23:55:20.000Z"}, {"author": "Jay Banks Music", "content": "Hey can you guys help me share my GoFundMe please, I would really appreciate it 🙏🏽. Peace and blessings.                                                                      https://www.gofundme.com/f/help-jevonte-become-someone?utm_medium=copy_link&utm_source=customer&utm_campaign=p_na+share-sheet&rcid=ec974baba4e6423d97059b8031405262", "score": "0", "time": "2020-02-27T23:39:07.000Z"}, {"author": "sandy red", "content": "👀    False Flags🏴🏴", "score": "1", "time": "2020-02-27T22:55:02.000Z"}, {"author": "Michael Yobs", "content": "That wasnt a training video", "score": "0", "time": "2020-02-27T22:30:49.000Z"}, {"author": "Abdullah", "content": "police look military illegal", "score": "0", "time": "2020-02-27T22:23:57.000Z"}, {"author": "Shon Seibert", "content": "Isn't that the brewery where Laverne n Shirley worked at?", "score": "0", "time": "2020-02-27T22:12:46.000Z"}]}