{"posted_time": "2020-02-20T02:36:41.000Z", "gathered_timestamp": "2020-04-10 23:08:42.744740", "link": "https://www.youtube.com/watch?v=FNm86mtWDes", "title": "Global National: Feb. 19, 2020 | Coronavirus outbreak could bring medical supply, drug shortage", "comments": [{"author": "Raihannah Taylor", "content": "For years many people in my community in the United States have asked for the return of factories and the reduction of automated machines. It's not only a concern regarding layoffs, loss of wages, and productivity, for many people who were once employed through industry, but about creating local jobs and having the ability to \"reopen\" or \"bring back\" factories where citizens once made products for the country they lived in.\nThinking back to the 1950's where cars, household products, beauty products, food supply, and small business thrived in local communities creating an economic boom in the United States helped this country thrive into a world power.\nYes, most of the world power was due to the success of winning of World War II, however, the United States made and produced its own products and wealth for many years until the business deals with China. Many factories were shut down, many communities had to find jobs in the city if they were from rural areas, and the education and skill requirements had completely changed.\nIn summary and to explain my point, with China being the #1 country to produce and create many products that citizens in the United States use, we have destroyed our own local businesses and factories and put so much into the cheap labor that China produces. The big businesses in the United States are cheap and have no regard for quality only quantity, putting all there eggs in China.\nNow we're all feeling the affects of it through COVID-19 and the basket has cracked.", "score": "0", "time": "2020-03-02T10:46:57.000Z"}, {"author": "James Snider", "content": "You need a PM with backbone... Right now you have a wet noodle.", "score": "0", "time": "2020-02-29T08:38:06.000Z"}, {"author": "T D", "content": "This virus scare is exactly that..a scare....the virus is no worse than any other virus...the cabal will use this to crash the economy and blame it on the virus...also...notice how the demonstrations stopped in Hong Kong...coincidence...I think not...think China won't kill their own...Mao Tre Hung killed millions!!!!", "score": "0", "time": "2020-02-26T21:25:14.000Z"}, {"author": "Anna Lee", "content": "I'm so so sorry for all the people who have coronaviras I hope you all get better very soon", "score": "0", "time": "2020-02-26T13:54:52.000Z"}, {"author": "Mark Nelson", "content": "How long does it stay on material, everything you buy on amazon or eBay comes from China 🇨🇳. Is it safe to get a package from there.", "score": "0", "time": "2020-02-24T18:40:54.000Z"}, {"author": "Mr. C", "content": "actually if its airborne and can breed in the air and if any planes had the exterior infected with the virus it could be breeding in the jet streams already which I fricken hope not but it is possible as people have been speculating it is airborne and aerosol which I think aerosol means it does not need a water droplet to transfer, then with rain/snow or any other weather system dust etc it will spread everywhere not much can be done but stockpile supplies if that is the case. I hope not but that is what my foresight says. I hope I am wrong I hope it is not airborne if it is they already effected everyone it's just a matter of time, well actually depending on the way the jetstream travels there would be potential safe zones but that's not considering birds and bugs carrying the virus so nvm actually. Get a mask while you can is what I think also get cans of soup and watnot. Eventually immunity will build in survivors and you may all survive. I'm type one diabetic so I'll prob die which sucks but not much I can do but try to prepare my family and people that will listen. I have high immunity to diseases though and my type one diabeties was causes by my own immune system attacking my islet cells they may have of been cancerous..so I may survive. We shall see *sigh* prepare better off to get ready for the worst and hope for the best. God bless I hope I'm wrong and I hope its not airborne/aerosol and I hope that is just pure speculation. Dont expect your leaders to tell you that they cant think like that. It's not their fault for not having that kind of foresight I have not seen anyone else say that either. All we can do is try to help each other survive", "score": "0", "time": "2020-02-23T06:52:32.000Z"}, {"author": "Oslec Liedbag", "content": "Clowns running the country.", "score": "0", "time": "2020-02-22T22:10:43.000Z"}, {"author": "Flow Em", "content": "Anything Trudeau says means nothing, we all know, and that is very sad.", "score": "0", "time": "2020-02-22T18:28:25.000Z"}, {"author": "jim beam", "content": "What caused the fire?", "score": "0", "time": "2020-02-22T14:05:54.000Z"}, {"author": "jim beam", "content": "No mask? Put new charcoal cigarette filters in your nose.", "score": "0", "time": "2020-02-22T13:59:47.000Z"}, {"author": "marco michele sp 1981", "content": "finchè restiamo in una Repubblica PARLAMENTARE ritengo illegittimo e arbitrario il fatto che i Governatori si attribuiscano (o assumano dovendo supplire a negligenze altrui) l'onere di limitare e sospendere le libertà costotuzionali dei cittadini. Se la ssanità è competenza delle regioni, la gestione di epidemie e potenziali emergenze umanitarie come quest non è loro competenza costituzionale.\n\n\nSi tratta di un abuso che l'urgenza e l'unità nazionale non possono giustificare, perchè creerebbe il primo precedente dal dopoguerra.\n\n\nAbbiamo sentito parlare dell'azione del Governo e di una Protezione Civile incapace e inetta nel risolvere i terremoti dell'Aquila, dell'Umbria, delle Marche e di Amatrice, alal quale ora si affida anche la gestione dell'emergenza sanitaria.\n\n\nSe la diffusione del virus continua, dovrà essere coinvolto anche l'Esercito. Perchè il Parlamento non costituisce un comitato interpalrmamentare di sorveglianze con pieni poteri di sipezione e controllo? Perchè non si impone al Governo Conte di nominar eun referente unico dellEsecutivo che informi il Parlamento sulla gestione dell'emergenza? Perchè il Presidente Mattarella non è coinvolto e non siede al tavolo dell'unità di crisi?", "score": "0", "time": "2020-02-22T13:49:36.000Z"}, {"author": "Marquez Kahpeaysewat", "content": "Respect first nation", "score": "0", "time": "2020-02-22T06:19:04.000Z"}, {"author": "gman h", "content": "Burn them all, thank me later", "score": "1", "time": "2020-02-22T05:01:33.000Z"}, {"author": "Bob S", "content": "kentaro iwata is a dead ringer for latka gravis on taxi.", "score": "0", "time": "2020-02-22T03:11:11.000Z"}, {"author": "mountainguyed67", "content": "Thumbs down for clickbait title.", "score": "0", "time": "2020-02-22T00:12:43.000Z"}, {"author": "Dreamssofblue Harmony", "content": "Could = Will.", "score": "0", "time": "2020-02-21T21:10:18.000Z"}, {"author": "Eric Di Angelo", "content": "Lmfao!! Indigenous people are disrupting the economy by blocking the trains carrying oil, in other news , another train derailed with 30 carts of oil some still leaking.  Sounds like the indigenous people don't want your your oil spills, how dare they!", "score": "0", "time": "2020-02-21T20:34:20.000Z"}, {"author": "Leo Groba", "content": "Canada needs a real Canadian to be in charge not this mr softy they have now.", "score": "1", "time": "2020-02-21T17:24:49.000Z"}, {"author": "Onslaught 306", "content": "Check your rights protesters. \nWe all have rights it’s just that some people feel like they can impose their rights on a nation yet call them selves victims.", "score": "0", "time": "2020-02-21T16:29:22.000Z"}, {"author": "abc xyz", "content": "Seeing how so many of these medications are going to go into a shortage and probably be so expensive most people cannot afford to purchase them, it might be a good idea to change your lifestyle and DIET so that you become healthier and look into natural cures.", "score": "0", "time": "2020-02-21T16:04:26.000Z"}, {"author": "Gerard Vinet", "content": "Theres always some jerks that contridict laws & put obstacles in their place , who incapicitate or hijack the country's economics , good & logical solutions .Even , if it cost more we still have our open airports to deliver merchandise , let's see them block our boeings from taking off , lol ?", "score": "1", "time": "2020-02-21T13:45:51.000Z"}, {"author": "OG Woot", "content": "The US gubment sprayed\nit's peaceful citizens protestors  with ice water hoses \nlike canons\n for trying to stop the pipeline.\n... Godspeed.", "score": "0", "time": "2020-02-21T13:28:15.000Z"}, {"author": "Easturn Vantage", "content": "This Is Indigenous land. Not white land. Recognize your roots.", "score": "0", "time": "2020-02-21T12:48:20.000Z"}, {"author": "Stinky Piece of Cheese", "content": "None of the reporters nor the politicians are native. None.\nHow many of board of directors of the pipeline company are native? None.", "score": "0", "time": "2020-02-21T11:36:35.000Z"}, {"author": "Stinky Piece of Cheese", "content": "Those pesky natives. Always causing problems, trashing land and stealing resources.\nSure.", "score": "0", "time": "2020-02-21T11:32:43.000Z"}, {"author": "London ays untied kingdom", "content": "All USA media bullik fake baby", "score": "0", "time": "2020-02-21T10:54:50.000Z"}, {"author": "Kennie Diamond", "content": "Every country in the world should give each citizen a free box of masks as a precautions measure whenever this virus has run its cource, and demand is gone.. Cause at some point in the future, another virus will appear.. It might be somewhat expensive to give such a box to everyone, but it could drastically lower the number of infected people who needs medical care.. cause guess what.. In a hospital, the staff has to go through multiple masks to treat the infected ones anyway, so more infected means more masks used, also.. the doctors needs payment, and more people infected means more death and a harder time to contain it, among alot of other stuff.. also, if everyone had masks already, the demand wouldnt be so high, meaning that whenever the next virus hits, hospitals would have all the masks they needed, instead of a shortage..\n\nSo yeah.. The box citizens could recieve could have a box of masks, a paper about virus/bacteria facts, a guideline on how and when to use the masks, and maybe some hand sanitizer and other stuff aswell.", "score": "0", "time": "2020-02-21T08:56:05.000Z"}, {"author": "Robert Castle", "content": "GcMaf  and C60 would be enormously helpful for people to take in order to build immune systems yet governments and the pharmaceutical companies keep this all secret,why?", "score": "0", "time": "2020-02-21T08:41:23.000Z"}, {"author": "Hans Tan", "content": "They can kiss the 2020 Olympics Goodbye if more are affected!", "score": "0", "time": "2020-02-21T06:49:31.000Z"}, {"author": "Stephanie Washington", "content": "Well japan, get ready. You’re about to hav a another huge outbreak 😷..u know besides the one u created on that ship.", "score": "0", "time": "2020-02-21T06:42:39.000Z"}, {"author": "b pavilion", "content": "My question is:  why are they putting blockades in the first place?  What kind of damage will the pipelines do to the land?", "score": "0", "time": "2020-02-21T04:47:26.000Z"}, {"author": "LoveAndLight 360", "content": "If it is native land there is no question, STAY OFF. The white man does it again, what he wants he takes - its disgusting. History repeats itself. A damn shame to all white people. Leave them alone and quit worrying about layoffs when you are breaking the law by being on native land.", "score": "0", "time": "2020-02-21T03:23:43.000Z"}, {"author": "D Loui", "content": "set them sailed antartica .....", "score": "1", "time": "2020-02-21T02:18:51.000Z"}, {"author": "Coronavirus", "content": "The end of the world is coming", "score": "0", "time": "2020-02-21T02:01:09.000Z"}, {"author": "ElLic Online", "content": "japan could have a local epidemy reladet to that mistake", "score": "0", "time": "2020-02-21T01:49:26.000Z"}, {"author": "Sweetchilliheat18", "content": "The original people need an army, a legit tank and helicopter army.\n\nMaybe then they would be given the respect they deserve.", "score": "0", "time": "2020-02-21T01:38:42.000Z"}, {"author": "Kay King", "content": "Canada MP, is weak af", "score": "0", "time": "2020-02-21T01:37:11.000Z"}, {"author": "Sweetchilliheat18", "content": "Its so simple, stop the pipeline. Problem solved.\n\nThe pipeline serves the rich, not the people of Canada.\n\nStop the pipeline. Ontario machinist", "score": "0", "time": "2020-02-21T01:37:01.000Z"}, {"author": "Jey Bird", "content": "Does anyone know why they're holding out? Are they wanting more money, or is it entirely on principle? This news seems one sided, let's hear from the leaders and what they're saying.", "score": "0", "time": "2020-02-21T00:38:55.000Z"}, {"author": "George Warkentin", "content": "Truedope and his liberal losers should be executed .", "score": "1", "time": "2020-02-21T00:27:25.000Z"}, {"author": "Anne Watt", "content": "Buy Ukraine buy India buy USA buy Spain buy Canadian \nLet's start up factories again here in canada that make stuff \nBoost our economy again in Canada \nCome on business men and women let's do it!\nRebuild Canada", "score": "3", "time": "2020-02-21T00:00:39.000Z"}, {"author": "Anne Watt", "content": "Steve Bannon trumps ex politician \nDid a talk show with a billionaire that says 250.,million in quarantined and 1.5 million infected that the numbers are not true what the Chinese Comunist Party is reporting \nAnd they are trying to get western media to only report good news", "score": "0", "time": "2020-02-20T23:56:57.000Z"}, {"author": "auni hanna", "content": "Prime minster has to put a pause on the pipe business for further Negotiation and enforce everything get back to Routine… other leaders would of done it already…this should never get that far…it seems this been planned by other party… all parties has to unite and Suport Each other to resolve it together…don’t flex muscles against each other… which Century are we in?!!!", "score": "0", "time": "2020-02-20T23:48:27.000Z"}, {"author": "kailyn.simard", "content": "lol they are sending the ppl on the ship to the nav centere in cornwall so imma die peace", "score": "1", "time": "2020-02-20T23:44:56.000Z"}, {"author": "Desley Mendoza", "content": "Makes no sense how a father would be the lone survivor in a house fire with 7 children. As a parent, I would die getting my children out. Survival for myself would be pointless if I couldn't get my children. This sounds so fishy.", "score": "0", "time": "2020-02-20T23:11:29.000Z"}, {"author": "Thomas Troxel", "content": "I thought that the \"Native Americans\" has their own \"Sovereign\" NATION within our borders. They are a \"Country\" within a Country? Companies can offer them money, but if they say \"No\"? Then the answer is \"NO\". As far as the \"Corona Virus\"? Everything we get from \"China\" including \"Prescriptions\" can be \"Contaminated\". What a \"Mess'.", "score": "0", "time": "2020-02-20T22:58:55.000Z"}, {"author": "James Trickman", "content": "The majority suffers in Canada because of just a few people being egged on or encouraged by non Canadian entities. Your president is either on it or just plain dumb. President or Prime minister whatever.", "score": "0", "time": "2020-02-20T22:55:19.000Z"}, {"author": "Great Spirit", "content": "It's there land. Show them some respect and like they said, speak with them before tearing up their lands.", "score": "0", "time": "2020-02-20T22:49:46.000Z"}, {"author": "David Gates", "content": "Lol! Who's the Real Bullies? Seems like the little people are getting stepped on! Again!", "score": "0", "time": "2020-02-20T22:18:20.000Z"}, {"author": "teachmehowtodoge", "content": "\"You don't need that gas pipeline. I'm one call away.\" - Elon Musk", "score": "0", "time": "2020-02-20T22:07:20.000Z"}, {"author": "Maheswara Reddy Satti", "content": "live nature live", "score": "0", "time": "2020-02-20T21:38:23.000Z"}, {"author": "Mary LaFrance", "content": "Typical corporate businessmen protecting business as usual. The native people get trounced upon for trying to protect their land from decimation by oil and gas, Take a look at what oil and gas has done to Tar Sands Alberta. And always the same excuse \"jobs and the economy\". This is a takings by oil and gas.", "score": "0", "time": "2020-02-20T21:13:33.000Z"}, {"author": "Reno Reins the BH", "content": "How do you allow protesters to block trains 😂what kind of country Canada is? I mean if you try block trains anywhere else, you'll get removed real fast. But these protesters seem to have some exceptional privilege.", "score": "2", "time": "2020-02-20T21:09:17.000Z"}, {"author": "From mb Mars", "content": "Air pollution causes 800,000 extra deaths a year in Europe and 8.8 million worldwide", "score": "0", "time": "2020-02-20T20:55:39.000Z"}, {"author": "MrLoobu", "content": "This is the future health of the land and the people. Lay offs < over generational environment health damage. Its 2020, fuck pipelines and fossil fuel expansion of any kind. Shut it down, their land is not to be played with for the gain of oil companies.", "score": "0", "time": "2020-02-20T20:27:10.000Z"}, {"author": "Tony Byrd", "content": "I swear I heard blockade before oh yeah SHTF scenario a certain group of people want to block the highways so the city's don't get any food, so what's the problem with the Indians doing it?", "score": "0", "time": "2020-02-20T20:24:35.000Z"}, {"author": "Ivan", "content": "Yea like half of this video is not about covid19", "score": "0", "time": "2020-02-20T20:19:17.000Z"}, {"author": "ManBearPig", "content": "I mean if the protesters believe they have the right to block the rails then anyone else has the right to tear down their blockades.", "score": "0", "time": "2020-02-20T19:57:29.000Z"}, {"author": "Joe Iazzetta", "content": "Anymore I'm only keeping track of the death toll outside of China. Chinas numbers are anybody's guess.", "score": "1", "time": "2020-02-20T19:57:29.000Z"}, {"author": "GodGunsGutsandNRA", "content": "How in the hell did China get control of 80% of worlds medications???? The most corrupt, communist country EVER???? Oh yeah, $$$$$$ payoff to governments!!!!", "score": "10", "time": "2020-02-20T19:48:53.000Z"}, {"author": "utube", "content": "I support the rail blockades..for too many years the \n\nfirst Nations of Canada have been walked over. bullied, and pushed around.  So glad to see them unite from coast to coast.  Stay strong.", "score": "0", "time": "2020-02-20T19:45:32.000Z"}, {"author": "Susan Zimmer", "content": "The logical solution is to make more masks to keep up with demand. Why aren't we doing that? In Canada, there's already a shortage of masks and there are only a handful of cases there. If you check medical supply stores, Walmarts, Shoppers Drug Marts and London Drugs, 3M respirator masks are all gone. The shelves are empty. If we can't keep up now, how are we going to keep up when it gets worse?", "score": "0", "time": "2020-02-20T19:04:26.000Z"}, {"author": "F U", "content": "I am sure this is all because of the gays...or maybe apartheid.", "score": "0", "time": "2020-02-20T18:55:44.000Z"}, {"author": "andy oak", "content": "Yeah great right  off the boat and into a taxi...lol . Is this  a joke?  Stupid  idiots", "score": "0", "time": "2020-02-20T18:38:09.000Z"}, {"author": "13BRAVO REDLEG", "content": "The cucks in Canadastan got problems....😝", "score": "1", "time": "2020-02-20T18:14:33.000Z"}, {"author": "Rachel Melhado", "content": "Send in the military", "score": "2", "time": "2020-02-20T17:49:45.000Z"}, {"author": "19lance20", "content": "MORE OIL, MORE CANCER, WORTH THE MONEY STILL?", "score": "0", "time": "2020-02-20T17:49:28.000Z"}, {"author": "19lance20", "content": "W.H.O. MAKING SURE THEIR BILLION DOLLAR BIO WEAPON GETS TO ITS DESTINATION TO SPREAD WHILE ASSURING THE PUBLIC THAT ALL OPERATIONS ARE UNDER CONTROL WHICH THEY ARE GOING AS PLANNED TO AGENDA 21 EUGENICS.", "score": "0", "time": "2020-02-20T17:48:48.000Z"}, {"author": "19lance20", "content": "THIS IS NOT JUST SOME INDIAN OR ECONOMIC ONLY ISSUE, THIS EFFECTS EVERYTHING PIPELINE MEANS MORE FRACING TO PRODUCE THE STUFF MEANS MORE DESTABILIZATION OF THE NORTH AMERICAN CRATON . BUT LETT THEM BLAB ABOUT ECONOMIC PAINS", "score": "1", "time": "2020-02-20T17:44:21.000Z"}, {"author": "19lance20", "content": "TAR SANDS PUTS OUT MORE POLLUTION THAN ALL CANADIAN CARS COMBINED", "score": "0", "time": "2020-02-20T17:43:08.000Z"}, {"author": "19lance20", "content": "75 PERCENT OF CANADIAN CHILDREN HAVE ASTHMA", "score": "0", "time": "2020-02-20T17:42:46.000Z"}, {"author": "pitikuss", "content": "weeeeel  socialsits in Canada are running scare....", "score": "2", "time": "2020-02-20T17:41:22.000Z"}, {"author": "M Hu", "content": "All the asks were bought up by the Chinese speculators.", "score": "0", "time": "2020-02-20T17:17:30.000Z"}, {"author": "Alex K", "content": "we are letting 15 chugs stop our critical supplies while our government should be stocking in prep for the virus that is about to rip through our population. One patriot with a gun could resolve this problem. Our government is ineffective and corrupt. And none of you will do anything about it. Our lack self awareness and liberal dilutions will be this country's downfall. 20% of people infected will die without hospital access. famine will be worse.", "score": "2", "time": "2020-02-20T17:05:40.000Z"}, {"author": "The Truth about Africa hurts", "content": "“Hereditary Chiefs”, whisky and glass beads used to work.", "score": "0", "time": "2020-02-20T17:05:06.000Z"}, {"author": "M Hu", "content": "The nations legal tribal leadership sold the rights to go through the land. These Chiefs are outlaws", "score": "3", "time": "2020-02-20T17:04:44.000Z"}, {"author": "MUHAMMAD BABA", "content": "I think its really unwise to let those people in that ship if they don't mean to kill them, this is because the ventilation is connected and the exchange of it is what is really causing the rapid transmission.", "score": "0", "time": "2020-02-20T16:42:23.000Z"}, {"author": "MissBot2U, PhD", "content": "Why have we all NOT learned from SARS years ago?!", "score": "2", "time": "2020-02-20T16:23:22.000Z"}, {"author": "666", "content": "39", "score": "0", "time": "2020-02-20T16:12:20.000Z"}, {"author": "MissBot2U, PhD", "content": "Unbelievable that they are allowing the blockades to crash their entire country. Very sad. How can anyone respect a bunch law breaking thugs at this point.", "score": "0", "time": "2020-02-20T16:09:58.000Z"}, {"author": "XpetraXpazlX", "content": "These people on the ships should have been taken to hospitals & be quarantined there.", "score": "3", "time": "2020-02-20T15:22:15.000Z"}, {"author": "Ken Rose", "content": "Thank you Global News for allowing comments on your site. Many, many Canadians have stopped watching CBC because our nationally funded CBC will not allow comments. A grateful Canadian...", "score": "3", "time": "2020-02-20T14:49:40.000Z"}, {"author": "Drowsypanther85", "content": "At what point did we stop considering fair and easy solutions but instead let us be held hostage by constant economic threats, have we still not evolved?", "score": "0", "time": "2020-02-20T14:35:46.000Z"}, {"author": "carlos soriano", "content": "Change you title!", "score": "1", "time": "2020-02-20T14:26:29.000Z"}, {"author": "Debra Sands", "content": "This should make the world rethink China . Everything it seems like comes from there.VERY DANGEROUS.WAKE UP PEOPLE.", "score": "8", "time": "2020-02-20T14:06:45.000Z"}, {"author": "chickensandw1tch", "content": "Could?? Bruh this is old news", "score": "0", "time": "2020-02-20T13:57:03.000Z"}, {"author": "Lynzy Lioness", "content": "Gotta love the media.....that train derailment story should have come right along with the Indigenous folks protesting. There's a huge reason they're blocking the rails.", "score": "0", "time": "2020-02-20T13:46:50.000Z"}, {"author": "Ready Or not", "content": "Skip ahead to 10:35 for Coronavirus update.", "score": "1", "time": "2020-02-20T13:31:24.000Z"}, {"author": "Django", "content": "Haha another example of Esau encroaching on Jacob's land. Hahaha. They do not want an oil pipeline on their land. I understand it.", "score": "0", "time": "2020-02-20T13:29:27.000Z"}, {"author": "sheenydonut", "content": "All these pipeline protesters have something in common. They're sheltered bourgeois liberals, usually white and waste no thought on anything passed the immediate scare tactics and skin deep politics that have been burned into their brains. They're so self important and obnoxious that they would sooner blockade crucial resources being delivered at a time when a major viral outbreak is looming. I could say a whole lot more but I'll keep it chill for now.", "score": "2", "time": "2020-02-20T12:49:38.000Z"}, {"author": "Don ta", "content": "A terrorist might kill small numbers of people but a coronavirus will kill mass numbers of people .. it will shut down entire cities or countries...", "score": "0", "time": "2020-02-20T12:36:37.000Z"}, {"author": "THE VIRAL VIDEO'S", "content": "Europe is the only land whites should be that's why it's so many problens In the world God gave them a strip of land but they wanna live on Indian Land on African land on brown black territory if the pilgrims stay on their strip of land everything would be fine", "score": "1", "time": "2020-02-20T11:56:49.000Z"}, {"author": "THE VIRAL VIDEO'S", "content": "He didn't go to jail for killing the kids SMH", "score": "0", "time": "2020-02-20T11:50:18.000Z"}, {"author": "rusty smith", "content": "WHY does global have to wait for a YouTube video to get the news. WE can do that. Yet you hacks get paid as journalists. What a joke. Wait until your masters can’t hide it by directing you people to keep people calm with your lame govt approved message. 🤮Global 🤮 Friesen 🤮Turd boy 🤮Mainstream media and MOSTLY 🤮🇨🇦Sheeple and their “woke” politeness. It’s going to get you all killed. This COVID19 data about antibiotics being made in China is at least 3 days old. Zerohedge people. Lose these msm channels they are placating you into danger.", "score": "0", "time": "2020-02-20T11:48:51.000Z"}, {"author": "Tiffany Kolesar", "content": "It takes up to 21 days to show any signs of having the virus so im not sure why they would risk everyone else.. 80% that the people they have let go who tested neg will turn positive and have spread it to others before they figure out that they have the virus..  Our government is f*cked up", "score": "0", "time": "2020-02-20T11:46:49.000Z"}, {"author": "billy bob Smith", "content": "Mohawks are terrorists.  Why do the protesters all hide their faces with masks ??? Do they have criminal records??? They don't seem to work and have lots of free time on their hands to disrupt everyone else. I say blockage all supplies such as propane and food to the First Nation Lands and we will see if they like their own medicine ???", "score": "1", "time": "2020-02-20T11:37:48.000Z"}, {"author": "rusty smith", "content": "Turd boy has no capital with the First Nations after his abysmal and OBVIOUSLY CORRUPT treatment of Jodi Wilson Raybold. As far as I’m concerned they should SCALP HIM.", "score": "8", "time": "2020-02-20T11:37:10.000Z"}, {"author": "Thomas Lindenthal", "content": "Zu Canada und wider werden die Ureinwohner betrogen wie währe es alle raus ausser Die Ureinwohner😎", "score": "0", "time": "2020-02-20T10:17:29.000Z"}, {"author": "Connie Pritchard Reinhardt", "content": "Thanks for this whole video. The pipe line should not go through natives land. It is their land! The corona virus has distracted many from other important things such as this. We all need to realize that we are headed for a stock crash that will be bad. God speed to all of us.", "score": "0", "time": "2020-02-20T10:03:10.000Z"}, {"author": "James Tan", "content": "Mr. Softy", "score": "0", "time": "2020-02-20T10:02:53.000Z"}]}