{"posted_time": "2020-01-31T22:19:09.000Z", "gathered_timestamp": "2020-04-10 23:06:11.767269", "link": "https://www.youtube.com/watch?v=3e0puo3lRHk", "title": "Trump admin declares public health emergency over coronavirus outbreak", "comments": [{"author": "Jane Doh", "content": "China lied & ppl (& the ENTIRE WORLD ECONOMY) died!!!", "score": "0", "time": "2020-04-10T01:27:05.000Z"}, {"author": "Just Curious", "content": "Fox News is a Health Hazard.", "score": "0", "time": "2020-03-22T00:19:08.000Z"}, {"author": "steven henson", "content": "Dem hoax !!! Trump offering socialist programs ...  Not on my watch !!!", "score": "0", "time": "2020-03-18T01:11:21.000Z"}, {"author": "jamar n' moor", "content": "Hahahahahahahahahahahahahahahaha....hahaha", "score": "0", "time": "2020-02-29T14:09:33.000Z"}, {"author": "265petsar", "content": "Pence is just a statue, gutless moron, this fool hasn't a clue about anything. When you sit back and let religious stories rule your schizophrenic mind, this is what you become........second in charge of the Asylum. Pence has been put in charge of the Coroner Virus situation because he's  too stupid to realise if things get worse, Trump will blame him for the outbreak in the USA and the drop in the economy, stating it wasn't his fault.  Talk about ' DUMB & DUMBER '. Only a matter of time before Trump and Fox News blame Democrates for the virus.", "score": "0", "time": "2020-02-28T04:26:15.000Z"}, {"author": "Robbie Southern", "content": "Wouldn’t surprise me if it’s communist China trying to slow down USA economy it was made in laboratory NOT FISH MARKET , I don’t trust them Chinese it effects older people and China has ageing population problem.", "score": "0", "time": "2020-02-27T22:15:32.000Z"}, {"author": "Scott Groves", "content": "Please, Please, Put a Graduate of Trump University to be in charge of this Emergency", "score": "0", "time": "2020-02-27T21:10:51.000Z"}, {"author": "Steve -O", "content": "If i get this virus i am heading straight for the nearest trump rally and coughing on everyone. If i get it so do you.", "score": "0", "time": "2020-02-27T16:32:38.000Z"}, {"author": "jasonauslander", "content": "I'm waiting for the creation of the Department of Thoughts and Prayers.", "score": "0", "time": "2020-02-27T14:55:48.000Z"}, {"author": "Nicki nurse", "content": "All he needs is a sharpie to change the CDC reports...AND IT WILL BE ZERO!!!", "score": "0", "time": "2020-02-27T06:11:21.000Z"}, {"author": "Tripwire68 Trig", "content": "So are we clear lets not give over to are enemies the basics of life and National defence with our jobs from manufacturing ect.... Lets make a deal your defence for a few more cents gained per purchase", "score": "0", "time": "2020-02-27T03:53:51.000Z"}, {"author": "Russ K", "content": "Trump fired the pandemic task force a couple of years ago. The genius at work protecting the American people.", "score": "0", "time": "2020-02-26T18:45:25.000Z"}, {"author": "manuel acosta", "content": "Don’t worry\nThat wall is going to contain the virus from USA", "score": "0", "time": "2020-02-26T01:54:41.000Z"}, {"author": "SupraSonic snk", "content": "🤣🤣🤣 you sheep", "score": "0", "time": "2020-02-24T22:35:32.000Z"}, {"author": "Cito Gonzalez", "content": "WHO:it ain’t a pandemic \n\nAmerica:yeah kid keep saying that we will be here once you pass away", "score": "0", "time": "2020-02-24T18:16:24.000Z"}, {"author": "db", "content": "All “confirmed” figures are to be multiplied by 10.", "score": "0", "time": "2020-02-09T18:46:15.000Z"}, {"author": "lance wolf", "content": "don't worry..Mike Pence has put together a powerful task force which includes Falwell jr, Robert Jeffress, Franklin graham and Paula white..  they are going to go to china to find the Witch causing the plague...and then burn her..but you have to burn her properly...otherwise the plague will continue. They will protect themselves from contracting the virus by keeping posies in their pockets..", "score": "1", "time": "2020-02-07T15:49:44.000Z"}, {"author": "Pablo solis", "content": "Prototype bio weapon virus being tested?", "score": "0", "time": "2020-02-07T00:31:03.000Z"}, {"author": "Beautiful Chaos", "content": "contagious while asymptomatic, in incubation, AND in sequelae that is what is so scary! Its been reported from within Wuhan that 5 million people left the city the day before lockdown ( following the Chinese New Year)... so the numbers they are reporting of people who could be  infectious, is EXTREMELY conservative. Its probably closer to 300,000 +. Major dishonesty in reporting.. this began in early DECEMBER and was shut up!!  This virus could hold through MAY before the PEAK!! And the big QUESTION, is it true there is a human manipulation aspect within the virus, and has it been manipulated with something that will come back around months from now... I heard someone speculate it could possibly be  injected with HIV??? ALSO was this potentially released on purpose as opposed to coming from BATS in the meat market? This virus is doubling every 6 days in number of REPORTED cases with every single infected person, passing it to at least 2 people.. not counting who you could still be infecting AFTER you are feeling well... SO MANY QUESTIONS... people should be educating the public on measures to take NOW  that will help.. like ascorbic acid, iodine rubbed in nostrils... oscillococcinum. But the most important thing is that THEY SHOULD BE HONEST IN THEIR REPORTING, third world countries will not survive this if we cannot get all the CLEAR FACTS!! AND PRESIDENT TRUMP IS ABSOLUTELY doing the best thing for AMERICA with  TRAVEL RESTRICTIONS!!", "score": "0", "time": "2020-02-04T20:25:44.000Z"}, {"author": "diele farias", "content": "I Love News", "score": "0", "time": "2020-02-04T13:24:09.000Z"}, {"author": "Tchow Deo", "content": "Who ever disliked this F-ing video wants to die. STUPIED D.", "score": "0", "time": "2020-02-04T05:45:10.000Z"}, {"author": "None Yourbiddness", "content": "That's cute. I told myself it was the Moment it was announced . Around New Years. Stay Stupid, Murica!", "score": "0", "time": "2020-02-04T01:21:27.000Z"}, {"author": "Robert Davidson", "content": "USA smart Canada stand IDIOTIC  stupid and senseless!", "score": "0", "time": "2020-02-03T08:51:31.000Z"}, {"author": "Chet Killips", "content": "Yep! Made in China, just like everything I buy. Thank you for that", "score": "0", "time": "2020-02-03T01:16:12.000Z"}, {"author": "Justin", "content": "Trump cares about the American people. I’m sure half the country hates that idea. Let’s come together and love one another", "score": "1", "time": "2020-02-02T22:41:46.000Z"}, {"author": "Demetrius Napavon", "content": "How is this any more dangerous than, being in Trumps presence?", "score": "0", "time": "2020-02-02T21:29:58.000Z"}, {"author": "Alam Udesky", "content": "This is an immediate order to send the afflicted to Miralago for complete treatment and compassionate people", "score": "0", "time": "2020-02-02T19:46:04.000Z"}, {"author": "Erika Murphy", "content": "We’re all dead", "score": "0", "time": "2020-02-02T18:22:26.000Z"}, {"author": "Rose Treiger", "content": "We are now locking the barn doors after the horse has already gotten out and is amongst you. Stupid. Complement the work of China? Stupid. What the flurk? the country that kills its own people by the millions? Are you freaking stupid. More people die from the flu. And anything the World Health Organization says I would rather run screaming into the night naked than listen to them.", "score": "0", "time": "2020-02-02T17:06:30.000Z"}, {"author": "Rose Treiger", "content": "All I can say is if you people have an inoculation you can stick it right up your blankety-blank, cuz I don't want it. Rather have the virus. 3 years of astronomical pain and unending medical issues from your mo fo flu shot. Don't even think I'm taking this s*** I don't care if Trump says so or not.", "score": "0", "time": "2020-02-02T17:04:11.000Z"}, {"author": "john clark", "content": "The Corona virus is a bio weapon WAKE UP", "score": "0", "time": "2020-02-02T16:44:58.000Z"}, {"author": "Jim Hammond", "content": "China, a Communist government that forces Socialism on the majority of their population and controls the narrative of the state run media, has lied to their people and the rest of the world since the first case occurred on 12/28/19 and the real numbers of this pandemic. What makes it even worse is the fact that they are arresting their citizens who have been telling the truth about the actual number of cases of infected in that country, probably well over 100,000 people. The Chinese government has claimed this virus started in a food market, but don't be surprised if the Chinese government weaponized this virus intentionally  to not only divert attention from the uprising of their own population that is fighting for freedom and Capitalism, but knowing that this virus would intentionally spread throughout the world with the intention of not only infecting people in other countries, but negatively impacting the economies of other countries...specifically trying to halt the US economy. A downward turn in the strong US economy could have an impact on who gets elected as President in November. And I have no doubt that China would go to any extent to stop the US from electing the current President again, who has held China accountable for their unfair trade agreements in the past with the US and has currently cost China billions of dollars for their economy.", "score": "0", "time": "2020-02-02T15:15:25.000Z"}, {"author": "Khali Khali", "content": "Right. Why did Trump fire the pandemic responce team in 2018?", "score": "0", "time": "2020-02-02T10:06:42.000Z"}, {"author": "PrettyGirl111", "content": "Not good enough! China thinks America is stupid because this virus has already spread in all provinces not just Hubei province.More will die if all flights from China are not shut down.", "score": "0", "time": "2020-02-02T09:41:14.000Z"}, {"author": "Based Roof Koreans", "content": "Epstein killed baby yoda!", "score": "0", "time": "2020-02-02T06:45:04.000Z"}, {"author": "Jay M", "content": "Trump tweets 'Top priority is the safety of American people' from bunker 200 ft underground.", "score": "0", "time": "2020-02-02T06:32:38.000Z"}, {"author": "Gil Ford", "content": "President Trump signs importation ban on all Mexican beer brands to prevent spread of the Corona virus. \n\"These are very bad beers, that's why I built the very big wall\"", "score": "0", "time": "2020-02-02T06:04:48.000Z"}, {"author": "Mystery Man", "content": "*You might as well go Super Saiyan 3 but it won't help you either*", "score": "1", "time": "2020-02-02T04:25:52.000Z"}, {"author": "James DeGray", "content": "If I were president Trump I would send a load or two of bleach to the quarantine zones, so they can stop saying he isn't doing enough, because most disposable products for handling this kind of contagen come from the region. And I hope people don't panic, but actually start paying attention and stop spreading diseases like this.", "score": "0", "time": "2020-02-02T02:03:56.000Z"}, {"author": "Hope Sorrowgrave, The Outcast", "content": "Well viruses are a part of nature whether you like it or not.", "score": "0", "time": "2020-02-02T01:23:37.000Z"}, {"author": "rbeck820", "content": "What about the airplane they rode in on? Send it all over the country?", "score": "0", "time": "2020-02-02T01:13:39.000Z"}, {"author": "N. Randall", "content": "End all Travel to and from CHINA.", "score": "0", "time": "2020-02-02T01:05:06.000Z"}, {"author": "Chase", "content": "He said legal Americans. What about illegal americans?", "score": "0", "time": "2020-02-02T01:03:52.000Z"}, {"author": "Aaron McCrea Lukman", "content": "October 2019, Xi Jinping Say: \"There is no power that can rival China\".\nCorona Virus: Are you sure about that bro!?", "score": "1", "time": "2020-02-02T00:49:23.000Z"}, {"author": "M Ninja", "content": "USA knock China economy out by corona virus.\nAlso best version of Brexit for UK .", "score": "0", "time": "2020-02-02T00:43:41.000Z"}, {"author": "the real kung fu", "content": "Coronnavirus is the offspring of African Ebola and SARS.  MADE IN WUHAN.", "score": "0", "time": "2020-02-02T00:32:37.000Z"}, {"author": "FRANKANDSTERN", "content": "Justin Trudeau you are a social butterfly whine and cheese light in the loafers moron.  How very responsible of the President.  It's too bad the clamp on traffic wasn't  set up from the get go by Chinese officials, not to mention the Global community.", "score": "0", "time": "2020-02-02T00:27:43.000Z"}, {"author": "ong kim", "content": "Crazy dog Trump and admin will be killed by a made in China SUPER VIRUS ,,slowly and painfully,,,,", "score": "0", "time": "2020-02-02T00:05:32.000Z"}, {"author": "daniel fulks", "content": "Please put the Superbowl on hold that will be nothing but a huge breeding ground for the virus!!!", "score": "0", "time": "2020-02-01T23:57:41.000Z"}, {"author": "X O", "content": "It's the safety of all human beings not only for the  american people's,  just only concerned about your own,  that was wrong,  it must be concerned with all human beings at risks.  Humanitarian aid,  Humanitarian assistance to the world.  All peoples are ONE in this planet called  EARTH .", "score": "0", "time": "2020-02-01T23:53:46.000Z"}, {"author": "C T", "content": "We japanese have been always annoyed by this filthy neighbor.", "score": "0", "time": "2020-02-01T23:46:15.000Z"}, {"author": "Jewish Princess", "content": "I love you Mr President.\nYou are the best President America has ever known.", "score": "0", "time": "2020-02-01T23:20:41.000Z"}, {"author": "Aimee Peng", "content": "what if we were to travel from cambodia？will we also have to take these safety measures as well？", "score": "0", "time": "2020-02-01T22:55:39.000Z"}, {"author": "Arv Clpal", "content": "hi y'all from Texas USA here, DO NOT GO TO ANY CHINESE RESTAURANT OR CHINESE STORE,ALL THERE PRODUCT ARE CONTAMINATED WITH CORONAVIRUS!02/02/2020", "score": "0", "time": "2020-02-01T22:47:19.000Z"}, {"author": "Wolfman", "content": "The good news, WWIII is on hold.", "score": "0", "time": "2020-02-01T22:32:12.000Z"}, {"author": "RUBICUNDUS ERATIUDAS", "content": "False. This is no different than the zika, the H1N2 Swine Flue, Chikungunya, Bird flue... This is just another distraction from the real news: Trump's impeachment.\r\nBy the end of February, everybody will have forgotten about this crap. Only difference: We have already learned about these lies already.", "score": "0", "time": "2020-02-01T22:23:16.000Z"}, {"author": "Stephen Erdley", "content": "They flew people, from china to the US, after the outbreak. The governments of the world, are spreading the virus.", "score": "1", "time": "2020-02-01T22:10:24.000Z"}, {"author": "Lake H", "content": "Did anyone else hear coughing in the background?", "score": "2", "time": "2020-02-01T21:38:43.000Z"}, {"author": "Kent Choo", "content": "China is the source of the virus sad isn't it, but at least they have the fastest construction builders in the world. According to CNBC, China is building two hospitals in less than two weeks to combat coronavirus. But hey Trump can build a border wall, but he needs more help there, i think part of of it has collapsed, due to some pleasant breeze. Let Trump prove he can build better than China, Cheer him on, lets see him at the border wall showing the greatest American construction ever. Go Trump!!!", "score": "1", "time": "2020-02-01T21:33:06.000Z"}, {"author": "Solomon Arthur", "content": "Just use nano silver", "score": "0", "time": "2020-02-01T21:29:09.000Z"}, {"author": "Ddewin Æther", "content": "Time to shut our borders.", "score": "1", "time": "2020-02-01T21:19:41.000Z"}, {"author": "Terrence P. Urbanis", "content": "Why doesn't the CDC/HHS/USGOV know ALL or have lists of the passengers from China coming into the USA at ports of entry and airport terminals?  Using the computers, it would be easy to know who is entering the country, country of origin and passport info.  Then track all of them down on an individual basis.  Also, past time to close up tight our southern border as we have no idea if Mexico is capable of screening incoming passengers and who knows how many infected people are trying to rush the southern border from many different countries.", "score": "0", "time": "2020-02-01T21:10:12.000Z"}, {"author": "Deb Carsey", "content": "So is it bad that I'm thinking CBS has unleashed this as a promo for their new adaptation of Stephen Kings  _The Stand_ ? My introvert self is fantasizing about living through the apocalypse with Gary Sinise       _M-o-o-n That spells Wuhan Flu_", "score": "0", "time": "2020-02-01T21:04:07.000Z"}, {"author": "Novus Ordo Seclorum", "content": "AFTER THEY ALREADY CAME HERE????", "score": "2", "time": "2020-02-01T21:01:46.000Z"}, {"author": "fallen son", "content": "im ready to die let goooooo spread it baby", "score": "0", "time": "2020-02-01T20:44:29.000Z"}, {"author": "Cyril", "content": "\"Democrats reflexively ask \"can we impeach him for that?\"\"", "score": "0", "time": "2020-02-01T20:41:47.000Z"}, {"author": "Geezee 5six2", "content": "Watch his dumbass go and ask the military to bomb the corona virus", "score": "0", "time": "2020-02-01T20:39:44.000Z"}, {"author": "Thomas Gassett", "content": "Trump administration : We lose around 40 thousand a year to the regular old flu.  Having seven people with Coronavirus, a variant of SARRS is nothing  to wet yourself over.", "score": "1", "time": "2020-02-01T20:31:27.000Z"}, {"author": "LoveNLaugh", "content": "There is no telling how many people came in contact and it spreads at a rapid pace. This is terrible!", "score": "0", "time": "2020-02-01T20:25:35.000Z"}, {"author": "John Villeneuve", "content": "This is SOOOOOOOOOOOOOOOOOOOOO FAKE!!!", "score": "0", "time": "2020-02-01T20:20:14.000Z"}, {"author": "John Villeneuve", "content": "They're gonna take are guns;  luckily our Trump will see through this coup!", "score": "0", "time": "2020-02-01T20:17:34.000Z"}, {"author": "Dylan Combrink", "content": "What if the Coronavirus was created by the US to cause distraction to continue plans against Iran", "score": "0", "time": "2020-02-01T20:14:27.000Z"}, {"author": "Alexis Ashley", "content": "Hopefully pelosie @ shift can stop him", "score": "0", "time": "2020-02-01T20:09:15.000Z"}, {"author": "krnxemb", "content": "No compliment to commie china nor who! What a BS statement. This should’ve been declared a week ago!", "score": "2", "time": "2020-02-01T20:00:41.000Z"}, {"author": "sudi yanto", "content": "SAYA SUDIYANTO DARI INDONESIA.\n\nDI BERITAHUKAN KEPADA SEMUA YANG TERINFEKSI VIRUS CORONA.\n\nMINUMLAH JUS PARE  HANGAT 50°C\n( JUICE BITTER MELON WARM 50°C). SATU GELAS ( CUP 100 ML )\n1 DAY 3X\n\nSEMOGA CEPAT SEMBUH\n\nTERIMAKASIHI AM SUDIYANTO FROM INDONESIA. NOTICE TO ALL INFECTED CORONA VIRUSES. DRINK JUICE PARE WARM 50 ° C (JUICE BITTER MELON WARM 50 ° C). ONE GLASS (CUP 100 ML) 1 DAY 3X GET WELL SOON THANK YOU", "score": "0", "time": "2020-02-01T19:52:43.000Z"}, {"author": "hudsontoo1212", "content": "Lol. There’s a man made protein in the virus, the WHO said “no big deal” at first- then said, “BIG DEAL”. The Chinese are leaking footage talking about hundreds of thousands being sick- posting videos of people falling out in the streets.... OH! And the Bill and Melinda Gates Foundation Ram a scenario like this, that killed 69 million people just a couple weeks before this all came to light. These people aren’t here to help us.", "score": "2", "time": "2020-02-01T19:52:05.000Z"}, {"author": "Diana Cline", "content": "Thank you mr president for thanking about America's first", "score": "0", "time": "2020-02-01T19:48:56.000Z"}, {"author": "whatever3210", "content": "Bio-weapon.", "score": "1", "time": "2020-02-01T19:47:35.000Z"}, {"author": "Zolee Little", "content": "Trump has enough IQ (...Obama hasn't)", "score": "0", "time": "2020-02-01T19:38:11.000Z"}, {"author": "Pinky poo Butt", "content": "Its a plague", "score": "0", "time": "2020-02-01T19:21:49.000Z"}, {"author": "ai Spadez", "content": "Plz trump take action i dont want this to hit my county ?", "score": "0", "time": "2020-02-01T19:15:32.000Z"}, {"author": "Andrew Izaguirre", "content": "What if the US created this to stop china and tax tariffs conspiracies 1🤫", "score": "0", "time": "2020-02-01T19:13:05.000Z"}, {"author": "Andrew Izaguirre", "content": "Its not that serious", "score": "0", "time": "2020-02-01T19:11:10.000Z"}, {"author": "Parkman", "content": "CNN: “Trump sends Asians to concentration camps”", "score": "0", "time": "2020-02-01T19:10:55.000Z"}, {"author": "Rick James", "content": "But a guy flies into Boston from Wuhan with the virus. So the delayed ban could infect thousands. This is careless.", "score": "1", "time": "2020-02-01T19:08:21.000Z"}, {"author": "Cloudblue0", "content": "Ok..?", "score": "0", "time": "2020-02-01T19:02:13.000Z"}, {"author": "APOCLUCE SPECTER", "content": "Now fine china", "score": "0", "time": "2020-02-01T19:01:41.000Z"}, {"author": "Daniel E", "content": "WHO works for Pharma.", "score": "1", "time": "2020-02-01T18:27:59.000Z"}, {"author": "david arms", "content": "Thanks china", "score": "1", "time": "2020-02-01T18:26:28.000Z"}, {"author": "Cliff Edward", "content": "Washing you're hands on a regular basis and using hand sanitizer reduces your're probability of being infected. Coronavirus has always existed via the common cold. This particular strain is just more potent. Also those dying from the virus are predominantly infants,  unhealthy people and senior citizens. You're average young healthy person will get sick, but will not die from this so everyone take a deep breath.", "score": "1", "time": "2020-02-01T18:22:07.000Z"}, {"author": "kiliankray", "content": "You got no witnesses that I was in China.", "score": "1", "time": "2020-02-01T18:22:06.000Z"}, {"author": "J Klimas", "content": "Has the question about the possibility that Chinese goods could be a possible source of contamination of corona virus been raised yet? Is there a risk of transferring this virus from surface contact of an infected surface? If so, maybe we should suspend trade from this region until they get their health issues under control.", "score": "0", "time": "2020-02-01T18:16:48.000Z"}, {"author": "MARJAN", "content": "I told y’all just drink Heineken😭", "score": "1", "time": "2020-02-01T17:27:03.000Z"}, {"author": "Archie - #lgbtpride", "content": "I can't wait to move the US when I am old enough. A country with free people. 1st and 2nd ammendment, a good president and controlled borders.", "score": "0", "time": "2020-02-01T17:19:22.000Z"}, {"author": "Zaira Cadena", "content": "28 days later", "score": "2", "time": "2020-02-01T17:17:43.000Z"}, {"author": "хот лот", "content": "coronavirus, I have a serum for diseases my whatsapp79609914348", "score": "0", "time": "2020-02-01T16:49:23.000Z"}, {"author": "GTR-J", "content": "Our Prime minister Potato Head up north is just letting people walk through airport security and he's also flying back 195 Canadians to Canada who have been quarantined in Woohan   🤷‍♂️\n\nThere's 3 cases in Ontario now", "score": "0", "time": "2020-02-01T16:34:05.000Z"}, {"author": "Nick M", "content": "People like to Criticize this man even when  he has the guts to take the necessary steps to protects Americans", "score": "1", "time": "2020-02-01T16:11:21.000Z"}, {"author": "Dewey Cheatum-Howe", "content": "**THE REPUBLICANS HAVE SOLD THE COUNTRY,  OUT. REPUBS DO NOT REPRESENT THE WILL OF THE PEOPLE. HISTORY WILL REMEMBER THIS DAY FOR ETERNITY. THE AMERICAN PUBLIC SHOULD TURN OUT IN MASSES THIS FALL AND TAKE THEIR COUNTRY BACK. VOTE STRAIGHT DEMOCRATIC TICK**", "score": "1", "time": "2020-02-01T15:51:00.000Z"}, {"author": "toby Jk", "content": "Chinese food is a no for me now", "score": "0", "time": "2020-02-01T15:40:20.000Z"}]}